zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.c
/*
 * Copyright 2025 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#include "fsl_clock.h"
#include "PERI_CCM.h"
#include "PERI_CGUANA.h"
#include "fsl_modcon.h"
#include "PERI_MODCON.h"
#include "fsl_reset.h"
#if defined(CLOCK_ENABLE_INFO_DUMP) && CLOCK_ENABLE_INFO_DUMP
#include "fsl_debug_console.h"
#endif
/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.clock"
#endif

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/* To make full use of CM7 hardware FPU, use double instead of uint64_t in clock driver to
achieve better performance, it is depend on the IDE Floating point settings, if double precision is selected
in IDE, clock_64b_t will switch to double type automatically. only support IAR and MDK here */
#if __FPU_USED

#if (defined(__ICCARM__))

#if (__ARMVFP__ >= __ARMFPV5__) && \
    (__ARM_FP == 0xE) /*0xe implies support for half, single and double precision operations*/
typedef double clock_64b_t;
#else
typedef uint64_t clock_64b_t;
#endif

#elif (defined(__GNUC__))

#if (__ARM_FP == 0xE) /*0xe implies support for half, single and double precision operations*/
typedef double clock_64b_t;
#else
typedef uint64_t clock_64b_t;
#endif

#elif defined(__CC_ARM) || defined(__ARMCC_VERSION)

#if defined __TARGET_FPU_FPV5_D16
typedef double clock_64b_t;
#else
typedef uint64_t clock_64b_t;
#endif

#else
typedef uint64_t clock_64b_t;
#endif

#else
typedef uint64_t clock_64b_t;
#endif

/*******************************************************************************
 * Variables
 ******************************************************************************/
const clock_name_t s_clockSourceNameCGU[][4] = {
    /*SRC0,                        SRC1,                        SRC2,                       SRC3,                           index      name   */ \
    { kCLOCK_SRC_OSC_24M,          kCLOCK_SRC_Invalid,          kCLOCK_SRC_Invalid,         kCLOCK_SRC_Invalid },        /* CGU ROOT 0 SXOSC */ \
    { kCLOCK_SRC_FRO_192M,         kCLOCK_SRC_OSC_24M,          kCLOCK_SRC_LPOSC_12M_CORE,  kCLOCK_SRC_LPOSC_1M_CORE },  /* CGU ROOT 1 BASE */ \
    { kCLOCK_SRC_FRO_24M,          kCLOCK_SRC_OSC_24M,          kCLOCK_SRC_LPOSC_12M_CORE,  kCLOCK_SRC_LPOSC_1M_CORE },  /* CGU ROOT 2 LOW */ \
    { kCLOCK_SRC_MAINPLL_DIV4,     kCLOCK_SRC_MAINPLL_DIV5,     kCLOCK_SRC_Invalid,         kCLOCK_SRC_Invalid },        /* CGU ROOT 3 MAINPLL_DIVX */ \
    { kCLOCK_SRC_SYSPLL_DIV4,      kCLOCK_SRC_SYSPLL_DIV5,      kCLOCK_SRC_Invalid,         kCLOCK_SRC_Invalid },        /* CGU ROOT 4 SYSPLL_DIVX */ \
    { kCLOCK_SRC_MAINPLL_DIVOUT1,  kCLOCK_SRC_MAINPLL_DIVOUT2,  kCLOCK_SRC_SYSPLL_DIVOUT1,  kCLOCK_SRC_SYSPLL_DIVOUT2 }, /* CGU ROOT 5 PLL_PFDX */ \
    { kCLOCK_SRC_MAINPLL_DIVOUT1,  kCLOCK_SRC_MAINPLL_DIVOUT2,  kCLOCK_SRC_SYSPLL_DIVOUT1,  kCLOCK_SRC_SYSPLL_DIVOUT2 }, /* CGU ROOT 6 MEDIA_PFDX */ \
    { kCLOCK_SRC_COREPLL_OUT,      kCLOCK_SRC_MAINPLL_DIVOUT2,  kCLOCK_SRC_SYSPLL_DIVOUT1,  kCLOCK_SRC_SYSPLL_DIVOUT2 }, /* CGU ROOT 7 MAINPFDX */ \
    { kCLOCK_SRC_COREPLL_OUT,      kCLOCK_SRC_MAINPLL_DIVOUT2,  kCLOCK_SRC_SYSPLL_DIVOUT1,  kCLOCK_SRC_SYSPLL_DIVOUT2 }, /* CGU ROOT 8 COMMPFDX */ \
    { kCLOCK_SRC_MAINPLL_DIV4,     kCLOCK_SRC_MAINPLL_DIV5,     kCLOCK_SRC_SYSPLL_DIV4,     kCLOCK_SRC_SYSPLL_DIV5 },    /* CGU ROOT 9 MAINDIVX */ \
    { kCLOCK_SRC_SAI0_MCLK,        kCLOCK_SRC_SAI1_MCLK,        kCLOCK_SRC_SAI2_MCLK,       kCLOCK_SRC_LPOSC_12M_CORE }, /* CGU ROOT 10 SAIMCLK */ \
    { kCLOCK_SRC_SAI0_MCLK,        kCLOCK_SRC_Invalid,          kCLOCK_SRC_Invalid,         kCLOCK_SRC_Invalid },        /* CGU ROOT 11 SAIMCLK0 */ \
    { kCLOCK_SRC_SAI1_MCLK,        kCLOCK_SRC_Invalid,          kCLOCK_SRC_Invalid,         kCLOCK_SRC_Invalid },        /* CGU ROOT 12 SAIMCLK1 */ \
    { kCLOCK_SRC_SAI2_MCLK,        kCLOCK_SRC_Invalid,          kCLOCK_SRC_Invalid,         kCLOCK_SRC_Invalid },        /* CGU ROOT 13 SAIMCLK2 */ \
    { kCLOCK_SRC_LPOSC_12M_CORE,   kCLOCK_SRC_Invalid,          kCLOCK_SRC_Invalid,         kCLOCK_SRC_Invalid },        /* CGU ROOT 14 LP12M_CORE */ \
    { kCLOCK_SRC_LPOSC_1M_CORE,    kCLOCK_SRC_Invalid,          kCLOCK_SRC_Invalid,         kCLOCK_SRC_Invalid },        /* CGU ROOT 15 LP1M_CORE */ \
    { kCLOCK_SRC_LPOSC32K,         kCLOCK_SRC_Invalid,          kCLOCK_SRC_Invalid,         kCLOCK_SRC_Invalid },        /* CGU ROOT 16 ULP32K */ \
    { kCLOCK_SRC_FRO_192M,         kCLOCK_SRC_Invalid,          kCLOCK_SRC_Invalid,         kCLOCK_SRC_Invalid },        /* CGU ROOT 17 FRO192M */ \
    { kCLOCK_SRC_FRO_96M,          kCLOCK_SRC_Invalid,          kCLOCK_SRC_Invalid,         kCLOCK_SRC_Invalid },        /* CGU ROOT 18 FRO96M */ \
    { kCLOCK_SRC_FRO_48M,          kCLOCK_SRC_Invalid,          kCLOCK_SRC_Invalid,         kCLOCK_SRC_Invalid },        /* CGU ROOT 19 FRO48M */ \
    { kCLOCK_SRC_FRO_24M,          kCLOCK_SRC_Invalid,          kCLOCK_SRC_Invalid,         kCLOCK_SRC_Invalid },        /* CGU ROOT 20 FRO24M */ \
    { kCLOCK_SRC_SYSPLL_DIV4,      kCLOCK_SRC_Invalid,          kCLOCK_SRC_Invalid,         kCLOCK_SRC_Invalid },        /* CGU ROOT 21 SYSPLLDIV4 */ \
    { kCLOCK_SRC_SYSPLL_DIV5,      kCLOCK_SRC_Invalid,          kCLOCK_SRC_Invalid,         kCLOCK_SRC_Invalid },        /* CGU ROOT 22 SYSPLLDIV5 */ \
    { kCLOCK_SRC_SYSPLL_DIV4,      kCLOCK_SRC_SYSPLL_DIV5,      kCLOCK_SRC_Invalid,         kCLOCK_SRC_Invalid },        /* CGU ROOT 23 SYSPLLDIVX */ \
    { kCLOCK_SRC_MAINPLL_DIV4,     kCLOCK_SRC_MAINPLL_DIV5,     kCLOCK_SRC_Invalid,         kCLOCK_SRC_Invalid },        /* CGU ROOT 24 MAINPLLDIVX */ \
    { kCLOCK_SRC_MAINPLL_DIV8,     kCLOCK_SRC_Invalid,          kCLOCK_SRC_Invalid,         kCLOCK_SRC_Invalid },        /* CGU ROOT 25 MAINPLLDIV8 */ \
    { kCLOCK_SRC_MAINPLL_DIV10,    kCLOCK_SRC_Invalid,          kCLOCK_SRC_Invalid,         kCLOCK_SRC_Invalid },        /* CGU ROOT 26 MAINPLLDIV10 */ \
    { kCLOCK_SRC_MAINPLL_DIV20,    kCLOCK_SRC_Invalid,          kCLOCK_SRC_Invalid,         kCLOCK_SRC_Invalid },        /* CGU ROOT 27 MAINPLLDIV20 */ \
    { kCLOCK_SRC_AUDIOPLL_DIVOUT,  kCLOCK_SRC_Invalid,          kCLOCK_SRC_Invalid,         kCLOCK_SRC_Invalid },        /* CGU ROOT 28 AUDIOPLL */ \
    { kCLOCK_SRC_VIDEOPLL_DIVOUT,  kCLOCK_SRC_Invalid,          kCLOCK_SRC_Invalid,         kCLOCK_SRC_Invalid },        /* CGU ROOT 29 VIDEOPLL */ \
    { kCLOCK_SRC_BASE,             kCLOCK_SRC_COREPLL_OUT,      kCLOCK_SRC_MAINPLL_DIVX,    kCLOCK_SRC_PLL_PFDX },       /* CGU ROOT 30 MAIN (renamed from CPU) */ \
    { kCLOCK_SRC_BASE,             kCLOCK_SRC_COREPLL_OUT,      kCLOCK_SRC_MAINPLL_DIVOUT1, kCLOCK_SRC_PLL_PFDX },       /* CGU ROOT 31 NPU */ \
    { kCLOCK_SRC_BASE,             kCLOCK_SRC_COREPLL_OUT,      kCLOCK_SRC_SYSPLL_DIVOUT2,  kCLOCK_SRC_PLL_PFDX },       /* CGU ROOT 32 MEDIABUS */ \
    { kCLOCK_SRC_BASE,             kCLOCK_SRC_SYSPLL_DIVOUT2,   kCLOCK_SRC_MAINPLL_DIVX,    kCLOCK_SRC_SYSPLL_DIVX },    /* CGU ROOT 33 AUDIOBUS */ \
    { kCLOCK_SRC_BASE,             kCLOCK_SRC_SYSPLL_DIVOUT2,   kCLOCK_SRC_MAINPLL_DIVX,    kCLOCK_SRC_SYSPLL_DIVX },    /* CGU ROOT 34 COMMBUS */ \
    { kCLOCK_SRC_LOW,              kCLOCK_SRC_FRO_192M,         kCLOCK_SRC_MAINPLL_DIVX,    kCLOCK_SRC_SYSPLL_DIVOUT2 }, /* CGU ROOT 35 WAKEBUS */ \
    { kCLOCK_SRC_LOW,              kCLOCK_SRC_FRO_48M,          kCLOCK_SRC_MAINPLL_DIV10,   kCLOCK_SRC_SYSPLL_DIV10 },   /* CGU ROOT 36 SYSCON_PDMAIN */ \
    { kCLOCK_SRC_BASE,             kCLOCK_SRC_MAINPLL_DIVOUT0,  kCLOCK_SRC_SYSPLL_DIVOUT0,  kCLOCK_SRC_SYSPLL_DIVOUT1 }, /* CGU ROOT 37 PERI0 */ \
    { kCLOCK_SRC_BASE,             kCLOCK_SRC_MAINPLL_DIVOUT1,  kCLOCK_SRC_SYSPLL_DIVOUT0,  kCLOCK_SRC_SYSPLL_DIVOUT1 }, /* CGU ROOT 38 PERI1 */ \
    { kCLOCK_SRC_BASE,             kCLOCK_SRC_MAINPLL_DIVOUT2,  kCLOCK_SRC_SYSPLL_DIVOUT0,  kCLOCK_SRC_SYSPLL_DIVOUT2 }, /* CGU ROOT 39 PERI2 */ \
    { kCLOCK_SRC_BASE,             kCLOCK_SRC_MAINPLL_DIVOUT2,  kCLOCK_SRC_MAINPLL_DIVX,    kCLOCK_SRC_SYSPLL_DIVOUT2 }, /* CGU ROOT 40 PERI3 */ \
    { kCLOCK_SRC_BASE,             kCLOCK_SRC_MAINPLL_DIVOUT0,  kCLOCK_SRC_MAINPLL_DIVX,    kCLOCK_SRC_SYSPLL_DIVOUT2 }, /* CGU ROOT 41 PERI4 */ \
    { kCLOCK_SRC_BASE,             kCLOCK_SRC_MAINPLL_DIVOUT0,  kCLOCK_SRC_MAINPLL_DIVX,    kCLOCK_SRC_SYSPLL_DIVOUT2 }, /* CGU ROOT 42 PERI5 */ \
    { kCLOCK_SRC_BASE,             kCLOCK_SRC_MAINPLL_DIVOUT1,  kCLOCK_SRC_MAINPLL_DIVX,    kCLOCK_SRC_SYSPLL_DIVOUT2 }, /* CGU ROOT 43 PERI6 */ \
    { kCLOCK_SRC_LOW,              kCLOCK_SRC_FRO_192M,         kCLOCK_SRC_MAINPLL_DIVOUT2, kCLOCK_SRC_SYSPLL_DIVOUT2 }, /* CGU ROOT 44 PERI7 */ \
    { kCLOCK_SRC_LOW,              kCLOCK_SRC_AUDIOPLL_DIVOUT,  kCLOCK_SRC_VIDEOPLL_DIVOUT, kCLOCK_SRC_SYSPLL_DIVOUT2 }, /* CGU ROOT 45 AUDIO */ \
    { kCLOCK_SRC_BASE,             kCLOCK_SRC_AUDIOPLL_DIVOUT,  kCLOCK_SRC_VIDEOPLL_DIVOUT, kCLOCK_SRC_MEDIA_PFDX },     /* CGU ROOT 46 VIDEO */ \
    { kCLOCK_SRC_FRO_48M,          kCLOCK_SRC_MAINPLL_DIVOUT1,  kCLOCK_SRC_MAINPLL_DIVOUT2, kCLOCK_SRC_SYSPLL_DIVOUT2 }, /* CGU ROOT 47 USB1 */ \
    { kCLOCK_SRC_BASE,             kCLOCK_SRC_MAINPLL_DIV8,     kCLOCK_SRC_MAINPLL_DIV20,   kCLOCK_SRC_SYSPLL_DIV20 },   /* CGU ROOT 48 ETH */ \
    { kCLOCK_SRC_TIE_LOW,          kCLOCK_SRC_COREPLL_OUT,      kCLOCK_SRC_MAINPLL_DIVOUT0, kCLOCK_SRC_SYSPLL_DIVOUT0 }, /* CGU ROOT 49 TEST */
#if 0
    { kCLOCK_SRC_PERI3,            kCLOCK_SRC_PERI5,            kCLOCK_SRC_FRO192M,         kCLOCK_SRC_MAINPLLDIV10 },   /* CGU ROOT 50 CLKOUT */
    { kCLOCK_SRC_FRO192M,          kCLOCK_SRC_Invalid,          kCLOCK_SRC_Invalid,         kCLOCK_SRC_Invalid },        /* CGU ROOT 51 MAIN_FRO192M */
    { kCLOCK_SRC_ULP32K,           kCLOCK_SRC_Invalid,          kCLOCK_SRC_Invalid,         kCLOCK_SRC_Invalid },        /* CGU ROOT 52 MAIN_ULP32K */
#endif
};

const clock_name_t s_clockSourceNameCMPT[][4] = {
    /*SRC0,                  SRC1,                SRC2,               SRC3,                         index      name   */ \
    { kCLOCK_SRC_MAIN,       kCLOCK_SRC_Invalid,  kCLOCK_SRC_Invalid, kCLOCK_SRC_Invalid },      /* CMPT ROOT 0 CMPT */ \
    { kCLOCK_SRC_CPU,        kCLOCK_SRC_Invalid,  kCLOCK_SRC_Invalid, kCLOCK_SRC_Invalid },      /* CMPT ROOT 1 CPU */ \
    { kCLOCK_SRC_NPU,        kCLOCK_SRC_Invalid,  kCLOCK_SRC_Invalid, kCLOCK_SRC_Invalid },      /* CMPT ROOT 2 NPU */ \
    { kCLOCK_SRC_LP1M_CORE,  kCLOCK_SRC_SXOSC,    kCLOCK_SRC_PERI4,   kCLOCK_SRC_MAINPLLDIV10 }, /* CMPT ROOT 3 SYSTICK0 */ \
    { kCLOCK_SRC_LP1M_CORE,  kCLOCK_SRC_SXOSC,    kCLOCK_SRC_PERI4,   kCLOCK_SRC_MAINPLLDIV10 }, /* CMPT ROOT 4 SYSTICK1 */ \
};

const clock_name_t s_clockSourceNameMAIN[][4] = {
    /*SRC0,                        SRC1,                      SRC2,                  SRC3,                         index      name   */ \
    { kCLOCK_SRC_MAIN,             kCLOCK_SRC_TIE_LOW,        kCLOCK_SRC_Invalid,    kCLOCK_SRC_Invalid },      /* MAIN ROOT 0 MAIN */ \
    { kCLOCK_SRC_MAIN_PERI0_DIV2,  kCLOCK_SRC_MAINPFDX_DIV2,  kCLOCK_SRC_SYSPLLDIV4, kCLOCK_SRC_SYSPLLDIV5 },   /* MAIN ROOT 1 XSPI0 */ \
    { kCLOCK_SRC_MAIN_PERI1_DIV2,  kCLOCK_SRC_MAINPFDX_DIV2,  kCLOCK_SRC_SYSPLLDIV4, kCLOCK_SRC_SYSPLLDIV5 },   /* MAIN ROOT 2 XSPI1 */ \
    { kCLOCK_SRC_PERI3,            kCLOCK_SRC_PERI4,          kCLOCK_SRC_FRO192M,    kCLOCK_SRC_SXOSC },        /* MAIN ROOT 3 I3C0 */ \
    { kCLOCK_SRC_PERI3,            kCLOCK_SRC_PERI4,          kCLOCK_SRC_FRO192M,    kCLOCK_SRC_SXOSC },        /* MAIN ROOT 4 LPI2C0 */ \
    { kCLOCK_SRC_PERI3,            kCLOCK_SRC_PERI4,          kCLOCK_SRC_FRO192M,    kCLOCK_SRC_SXOSC },        /* MAIN ROOT 5 LPI2C1 */ \
    { kCLOCK_SRC_PERI2,            kCLOCK_SRC_PERI4,          kCLOCK_SRC_FRO192M,    kCLOCK_SRC_MAINDIVX },     /* MAIN ROOT 6 LPSPI0 */ \
    { kCLOCK_SRC_PERI2,            kCLOCK_SRC_PERI4,          kCLOCK_SRC_FRO192M,    kCLOCK_SRC_MAINDIVX },     /* MAIN ROOT 7 LPSPI1 */ \
    { kCLOCK_SRC_PERI2,            kCLOCK_SRC_PERI4,          kCLOCK_SRC_FRO192M,    kCLOCK_SRC_MAINDIVX },     /* MAIN ROOT 8 LPSPI2 */ \
    { kCLOCK_SRC_PERI2,            kCLOCK_SRC_PERI4,          kCLOCK_SRC_FRO192M,    kCLOCK_SRC_MAINDIVX },     /* MAIN ROOT 9 LPSPI3 */ \
    { kCLOCK_SRC_PERI2,            kCLOCK_SRC_PERI4,          kCLOCK_SRC_FRO192M,    kCLOCK_SRC_MAINDIVX },     /* MAIN ROOT 10 LPSPI4 */ \
    { kCLOCK_SRC_PERI3,            kCLOCK_SRC_PERI4,          kCLOCK_SRC_FRO192M,    kCLOCK_SRC_SXOSC },        /* MAIN ROOT 11 LPUART0 */ \
    { kCLOCK_SRC_PERI3,            kCLOCK_SRC_PERI4,          kCLOCK_SRC_FRO192M,    kCLOCK_SRC_SXOSC },        /* MAIN ROOT 12 LPUART1 */ \
    { kCLOCK_SRC_PERI3,            kCLOCK_SRC_PERI4,          kCLOCK_SRC_FRO192M,    kCLOCK_SRC_SXOSC },        /* MAIN ROOT 13 LPUART2 */ \
    { kCLOCK_SRC_PERI3,            kCLOCK_SRC_PERI4,          kCLOCK_SRC_FRO192M,    kCLOCK_SRC_SXOSC },        /* MAIN ROOT 14 LPUART3 */ \
    { kCLOCK_SRC_PERI3,            kCLOCK_SRC_PERI4,          kCLOCK_SRC_FRO192M,    kCLOCK_SRC_SXOSC },        /* MAIN ROOT 15 LPUART4 */ \
    { kCLOCK_SRC_PERI3,            kCLOCK_SRC_PERI4,          kCLOCK_SRC_FRO192M,    kCLOCK_SRC_SXOSC },        /* MAIN ROOT 16 LPUART5 */ \
    { kCLOCK_SRC_PERI1,            kCLOCK_SRC_PERI4,          kCLOCK_SRC_FRO192M,    kCLOCK_SRC_SXOSC },        /* MAIN ROOT 17 FLEXCAN0 */ \
    { kCLOCK_SRC_PERI1,            kCLOCK_SRC_PERI4,          kCLOCK_SRC_FRO192M,    kCLOCK_SRC_SXOSC },        /* MAIN ROOT 18 FLEXCAN1 */ \
    { kCLOCK_SRC_PERI1,            kCLOCK_SRC_PERI4,          kCLOCK_SRC_FRO192M,    kCLOCK_SRC_SXOSC },        /* MAIN ROOT 19 FLEXCAN2 */ \
    { kCLOCK_SRC_PERI1,            kCLOCK_SRC_PERI4,          kCLOCK_SRC_FRO192M,    kCLOCK_SRC_SXOSC },        /* MAIN ROOT 20 FLEXCAN_GFCLK */ \
    { kCLOCK_SRC_PERI3,            kCLOCK_SRC_PERI5,          kCLOCK_SRC_FRO192M,    kCLOCK_SRC_SXOSC },        /* MAIN ROOT 21 QTPM0 */ \
    { kCLOCK_SRC_PERI3,            kCLOCK_SRC_PERI5,          kCLOCK_SRC_FRO192M,    kCLOCK_SRC_MAINPLLDIV10 }, /* MAIN ROOT 22 LPIT0 */ \
    { kCLOCK_SRC_PERI3,            kCLOCK_SRC_PERI5,          kCLOCK_SRC_FRO192M,    kCLOCK_SRC_MAINPLLDIV10 }, /* MAIN ROOT 23 LPIT1 */ \
    { kCLOCK_SRC_PERI3,            kCLOCK_SRC_PERI5,          kCLOCK_SRC_FRO192M,    kCLOCK_SRC_MAINPLLDIV10 }, /* MAIN ROOT 24 ADC0 */ \
    { kCLOCK_SRC_PERI3,            kCLOCK_SRC_PERI5,          kCLOCK_SRC_FRO192M,    kCLOCK_SRC_MAINPLLDIV10 }, /* MAIN ROOT 25 ADC1 */ \
    { kCLOCK_SRC_PERI3,            kCLOCK_SRC_PERI5,          kCLOCK_SRC_FRO192M,    kCLOCK_SRC_MAINPLLDIV10 }, /* MAIN ROOT 26 SINC0 */ \
    { kCLOCK_SRC_PERI3,            kCLOCK_SRC_PERI5,          kCLOCK_SRC_FRO192M,    kCLOCK_SRC_MAINPLLDIV10 }, /* MAIN ROOT 27 SINC1 */ \
    { kCLOCK_SRC_PERI0,            kCLOCK_SRC_PERI5,          kCLOCK_SRC_FRO192M,    kCLOCK_SRC_MAINDIVX },     /* MAIN ROOT 28 FLEXIO0 */ \
    { kCLOCK_SRC_PERI0,            kCLOCK_SRC_PERI5,          kCLOCK_SRC_FRO192M,    kCLOCK_SRC_MAINDIVX },     /* MAIN ROOT 29 FLEXIO1 */ \
    { kCLOCK_SRC_PERI0,            kCLOCK_SRC_PERI5,          kCLOCK_SRC_FRO192M,    kCLOCK_SRC_MAINDIVX },     /* MAIN ROOT 30 FLEXIO2 */ \
    { kCLOCK_SRC_PERI3,            kCLOCK_SRC_SYSPLLDIV4,     kCLOCK_SRC_FRO192M,    kCLOCK_SRC_MAINDIVX },     /* MAIN ROOT 31 TPIU */ \
    { kCLOCK_SRC_FRO96M,           kCLOCK_SRC_MAINPLLDIV10,   kCLOCK_SRC_TIE_LOW,    kCLOCK_SRC_Invalid },      /* MAIN ROOT 32 CSSI_REFCLK */ \
    { kCLOCK_SRC_SXOSC,            kCLOCK_SRC_MAINPLLDIV10,   kCLOCK_SRC_FRO192M,    kCLOCK_SRC_FRO24M },       /* MAIN ROOT 33 OTP */ \
    { kCLOCK_SRC_PERI3,            kCLOCK_SRC_PERI5,          kCLOCK_SRC_FRO192M,    kCLOCK_SRC_MAINPLLDIV10 }, /* MAIN ROOT 34 CLKOUT */ \
    { kCLOCK_SRC_FRO192M,          kCLOCK_SRC_Invalid,        kCLOCK_SRC_Invalid,    kCLOCK_SRC_Invalid },      /* MAIN ROOT 35 MAIN_FRO192M */ \
    { kCLOCK_SRC_ULP32K,           kCLOCK_SRC_Invalid,        kCLOCK_SRC_Invalid,    kCLOCK_SRC_Invalid },      /* MAIN ROOT 36 MAIN_ULP32K */ \
};

const clock_name_t s_clockSourceNameWAKE[][4] = {
    /*SRC0,                   SRC1,                   SRC2,                  SRC3,                      index      name   */ \
    { kCLOCK_SRC_WAKEBUS,     kCLOCK_SRC_LP12M_WAKE,  kCLOCK_SRC_LP2M_WAKE,  kCLOCK_SRC_Invalid },   /* WAKE ROOT 0 WAKE */ \
    { kCLOCK_SRC_SXOSC,       kCLOCK_SRC_Invalid,     kCLOCK_SRC_Invalid,    kCLOCK_SRC_Invalid },   /* WAKE ROOT 1 WAKE_SXOSC */ \
    { kCLOCK_SRC_LP1M_WAKE,   kCLOCK_SRC_Invalid,     kCLOCK_SRC_Invalid,    kCLOCK_SRC_Invalid },   /* WAKE ROOT 2 WAKE_LP1M */ \
    { kCLOCK_SRC_LP12M_WAKE,  kCLOCK_SRC_Invalid,     kCLOCK_SRC_Invalid,    kCLOCK_SRC_Invalid },   /* WAKE ROOT 3 WAKE_LP12M */ \
    { kCLOCK_SRC_ULP32K,      kCLOCK_SRC_Invalid,     kCLOCK_SRC_Invalid,    kCLOCK_SRC_Invalid },   /* WAKE ROOT 4 WAKE_ULP32K */ \
    { kCLOCK_SRC_LP1M_WAKE,   kCLOCK_SRC_LP12M_WAKE,  kCLOCK_SRC_LP2M_WAKE,  kCLOCK_SRC_Invalid },   /* WAKE ROOT 5 WAKE_LPCLK */ \
    { kCLOCK_SRC_PERI7,       kCLOCK_SRC_FRO24M,      kCLOCK_SRC_WAKE_LPCLK, kCLOCK_SRC_SXOSC },     /* WAKE ROOT 6 I3C1 */ \
    { kCLOCK_SRC_PERI7,       kCLOCK_SRC_FRO24M,      kCLOCK_SRC_WAKE_LPCLK, kCLOCK_SRC_SXOSC },     /* WAKE ROOT 7 LPI2C2 */ \
    { kCLOCK_SRC_PERI7,       kCLOCK_SRC_FRO24M,      kCLOCK_SRC_WAKE_LPCLK, kCLOCK_SRC_SXOSC },     /* WAKE ROOT 8 LPI2C3 */ \
    { kCLOCK_SRC_PERI7,       kCLOCK_SRC_FRO24M,      kCLOCK_SRC_WAKE_LPCLK, kCLOCK_SRC_SXOSC },     /* WAKE ROOT 9 LPSPI0 */ \
    { kCLOCK_SRC_PERI7,       kCLOCK_SRC_FRO24M,      kCLOCK_SRC_WAKE_LPCLK, kCLOCK_SRC_ULP32K },    /* WAKE ROOT 10 LPUART0 */ \
    { kCLOCK_SRC_PERI7,       kCLOCK_SRC_FRO24M,      kCLOCK_SRC_WAKE_LPCLK, kCLOCK_SRC_ULP32K },    /* WAKE ROOT 11 LPUART1 */ \
    { kCLOCK_SRC_PERI7,       kCLOCK_SRC_AUDIO,       kCLOCK_SRC_WAKE_LPCLK, kCLOCK_SRC_SAIMCLK },   /* WAKE ROOT 12 DMIC1_APPCLK */ \
    { kCLOCK_SRC_PERI7,       kCLOCK_SRC_AUDIO,       kCLOCK_SRC_WAKE_LPCLK, kCLOCK_SRC_ULP32K },    /* WAKE ROOT 13 QTPM0 */ \
    { kCLOCK_SRC_ULP32K,      kCLOCK_SRC_LP1M_WAKE,   kCLOCK_SRC_WAKE_LPCLK, kCLOCK_SRC_SXOSC },     /* WAKE ROOT 14 LPTMR0 */ \
    { kCLOCK_SRC_ULP32K,      kCLOCK_SRC_LP1M_WAKE,   kCLOCK_SRC_WAKE_LPCLK, kCLOCK_SRC_SXOSC },     /* WAKE ROOT 15 LPTMR1 */ \
    { kCLOCK_SRC_ULP32K,      kCLOCK_SRC_LP1M_WAKE,   kCLOCK_SRC_TIE_LOW,    kCLOCK_SRC_Invalid },   /* WAKE ROOT 16 SWT0 */ \
    { kCLOCK_SRC_ULP32K,      kCLOCK_SRC_LP1M_WAKE,   kCLOCK_SRC_TIE_LOW,    kCLOCK_SRC_Invalid },   /* WAKE ROOT 17 SWT1 */ \
    { kCLOCK_SRC_ULP32K,      kCLOCK_SRC_LP1M_WAKE,   kCLOCK_SRC_TIE_LOW,    kCLOCK_SRC_Invalid },   /* WAKE ROOT 18 EWM */ \
    { kCLOCK_SRC_PERI7,       kCLOCK_SRC_FRO24M,      kCLOCK_SRC_WAKE_LPCLK, kCLOCK_SRC_SXOSC },     /* WAKE ROOT 19 ACMP0 */ \
    { kCLOCK_SRC_PERI7,       kCLOCK_SRC_FRO24M,      kCLOCK_SRC_WAKE_LPCLK, kCLOCK_SRC_SXOSC },     /* WAKE ROOT 20 ACMP1 */ \
    { kCLOCK_SRC_PERI7,       kCLOCK_SRC_FRO24M,      kCLOCK_SRC_WAKE_LPCLK, kCLOCK_SRC_SXOSC },     /* WAKE ROOT 21 ACMP2 */ \
    { kCLOCK_SRC_PERI7,       kCLOCK_SRC_FRO24M,      kCLOCK_SRC_WAKE_LPCLK, kCLOCK_SRC_SXOSC },     /* WAKE ROOT 22 ACMP3 */ \
    { kCLOCK_SRC_ULP32K,      kCLOCK_SRC_FRO24M,      kCLOCK_SRC_WAKE_LPCLK, kCLOCK_SRC_LP1M_WAKE }, /* WAKE ROOT 23 ACMP0_RRCLK */ \
    { kCLOCK_SRC_ULP32K,      kCLOCK_SRC_FRO24M,      kCLOCK_SRC_WAKE_LPCLK, kCLOCK_SRC_LP1M_WAKE }, /* WAKE ROOT 24 ACMP1_RRCLK */ \
    { kCLOCK_SRC_ULP32K,      kCLOCK_SRC_FRO24M,      kCLOCK_SRC_WAKE_LPCLK, kCLOCK_SRC_LP1M_WAKE }, /* WAKE ROOT 25 ACMP2_RRCLK */ \
    { kCLOCK_SRC_ULP32K,      kCLOCK_SRC_FRO24M,      kCLOCK_SRC_WAKE_LPCLK, kCLOCK_SRC_LP1M_WAKE }, /* WAKE ROOT 26 ACMP3_RRCLK */ \
};

