zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.c
const clock_name_t s_clockSourceNameCOMM[][4] = {
    /*SRC0,                        SRC1,                      SRC2,                  SRC3,                        index      name   */ \
    { kCLOCK_SRC_COMMBUS,          kCLOCK_SRC_Invalid,        kCLOCK_SRC_Invalid,    kCLOCK_SRC_Invalid },     /* COMM ROOT 0 COMM */ \
    { kCLOCK_SRC_ULP32K,           kCLOCK_SRC_Invalid,        kCLOCK_SRC_Invalid,    kCLOCK_SRC_Invalid },     /* COMM ROOT 1 COMM_ULP32K */ \
    { kCLOCK_SRC_COMM_PERI1_DIV2,  kCLOCK_SRC_COMMPFDX_DIV2,  kCLOCK_SRC_SYSPLLDIV4, kCLOCK_SRC_SYSPLLDIV5 },  /* COMM ROOT 2 USDHC0 */ \
    { kCLOCK_SRC_COMM_PERI2_DIV2,  kCLOCK_SRC_COMMPFDX_DIV2,  kCLOCK_SRC_SYSPLLDIV4, kCLOCK_SRC_SYSPLLDIV5 },  /* COMM ROOT 3 USDHC1 */ \
    { kCLOCK_SRC_PERI1,            kCLOCK_SRC_PERI2,          kCLOCK_SRC_SYSPLLDIV4, kCLOCK_SRC_SYSPLLDIV5 },  /* COMM ROOT 4 XSPIR */ \
    { kCLOCK_SRC_SXOSC,            kCLOCK_SRC_Invalid,        kCLOCK_SRC_Invalid,    kCLOCK_SRC_Invalid },     /* COMM ROOT 5 USB0_PHYCLK */ \
    { kCLOCK_SRC_FRO48M,           kCLOCK_SRC_Invalid,        kCLOCK_SRC_Invalid,    kCLOCK_SRC_Invalid },     /* COMM ROOT 6 USB0_FRO48M */ \
    { kCLOCK_SRC_USB1,             kCLOCK_SRC_USBPLL_OUT,     kCLOCK_SRC_USBPLL_48M, kCLOCK_SRC_FRO48M },      /* COMM ROOT 7 USB1 */ \
    { kCLOCK_SRC_ULP32K,           kCLOCK_SRC_LP1M_CORE,      kCLOCK_SRC_SXOSC,      kCLOCK_SRC_TIE_LOW },     /* COMM ROOT 8 USB0_WAKECLK */ \
    { kCLOCK_SRC_COMMBUS,          kCLOCK_SRC_ETH,            kCLOCK_SRC_SYSPLLDIV4, kCLOCK_SRC_MAINPLLDIV8 }, /* COMM ROOT 9 ETH0_TRXCLK */ \
    { kCLOCK_SRC_COMMBUS,          kCLOCK_SRC_ETH,            kCLOCK_SRC_SXOSC,      kCLOCK_SRC_MAINPLLDIV8 }, /* COMM ROOT 10 ETH0_TIMERCLK */ \
    { kCLOCK_SRC_COMMBUS,          kCLOCK_SRC_ETH,            kCLOCK_SRC_SYSPLLDIV4, kCLOCK_SRC_MAINPLLDIV8 }, /* COMM ROOT 11 ETH1_TRXCLK */ \
    { kCLOCK_SRC_COMMBUS,          kCLOCK_SRC_ETH,            kCLOCK_SRC_SXOSC,      kCLOCK_SRC_MAINPLLDIV8 }, /* COMM ROOT 12 ETH1_TIMERCLK */ \
    { kCLOCK_SRC_COMMBUS,          kCLOCK_SRC_ETH,            kCLOCK_SRC_SXOSC,      kCLOCK_SRC_MAINPLLDIV8 }, /* COMM ROOT 13 ETH_REFCLK */ \
    { kCLOCK_SRC_COMMBUS,          kCLOCK_SRC_MAINPLLDIV10,   kCLOCK_SRC_SYSPLLDIV4, kCLOCK_SRC_SYSPLLDIV5 },  /* COMM ROOT 14 XENO0_LIWCLK */ \
    { kCLOCK_SRC_COMMBUS,          kCLOCK_SRC_MAINPLLDIV10,   kCLOCK_SRC_SYSPLLDIV4, kCLOCK_SRC_SYSPLLDIV5 },  /* COMM ROOT 15 XENO1_LIWCLK */ \
    { kCLOCK_SRC_MAINPLLDIV10,     kCLOCK_SRC_Invalid,        kCLOCK_SRC_Invalid,    kCLOCK_SRC_Invalid },     /* COMM ROOT 16 DLL_REFCLK */ \
};

const clock_name_t s_clockSourceNameAUDIO[][4] = {
    /*SRC0,                 SRC1,                 SRC2,                    SRC3,                     index      name   */ \
    { kCLOCK_SRC_AUDIOBUS,  kCLOCK_SRC_Invalid,   kCLOCK_SRC_Invalid,      kCLOCK_SRC_Invalid },  /* AUDIO ROOT 0 AUDIO */ \
    { kCLOCK_SRC_PERI6,     kCLOCK_SRC_AUDIOPLL,  kCLOCK_SRC_AUDIO,        kCLOCK_SRC_SAIMCLK },  /* AUDIO ROOT 1 DMIC0_APPCLK */ \
    { kCLOCK_SRC_PERI6,     kCLOCK_SRC_AUDIOPLL,  kCLOCK_SRC_AUDIO,        kCLOCK_SRC_SAIMCLK0 }, /* AUDIO ROOT 2 SAI0_MCLK0 */ \
    { kCLOCK_SRC_PERI6,     kCLOCK_SRC_AUDIOPLL,  kCLOCK_SRC_AUDIO,        kCLOCK_SRC_SAIMCLK },  /* AUDIO ROOT 3 SAI0_MCLK1 */ \
    { kCLOCK_SRC_PERI6,     kCLOCK_SRC_AUDIOPLL,  kCLOCK_SRC_AUDIO,        kCLOCK_SRC_SAIMCLK1 }, /* AUDIO ROOT 4 SAI1_MCLK0 */ \
    { kCLOCK_SRC_PERI6,     kCLOCK_SRC_AUDIOPLL,  kCLOCK_SRC_AUDIO,        kCLOCK_SRC_SAIMCLK },  /* AUDIO ROOT 5 SAI1_MCLK1 */ \
    { kCLOCK_SRC_PERI6,     kCLOCK_SRC_AUDIOPLL,  kCLOCK_SRC_AUDIO,        kCLOCK_SRC_SAIMCLK2 }, /* AUDIO ROOT 6 SAI2_MCLK0 */ \
    { kCLOCK_SRC_PERI6,     kCLOCK_SRC_AUDIOPLL,  kCLOCK_SRC_AUDIO,        kCLOCK_SRC_SAIMCLK },  /* AUDIO ROOT 7 SAI2_MCLK1 */ \
    { kCLOCK_SRC_PERI6,     kCLOCK_SRC_AUDIOPLL,  kCLOCK_SRC_AUDIO,        kCLOCK_SRC_SAIMCLK },  /* AUDIO ROOT 8 SPDIF_TXCLK */ \
    { kCLOCK_SRC_PERI6,     kCLOCK_SRC_AUDIOPLL,  kCLOCK_SRC_MAINPLLDIV10, kCLOCK_SRC_AUDIOBUS }, /* AUDIO ROOT 9 SPDIF_CDRCLK */ \
    { kCLOCK_SRC_PERI6,     kCLOCK_SRC_AUDIOPLL,  kCLOCK_SRC_MAINPLLDIV10, kCLOCK_SRC_AUDIOBUS }, /* AUDIO ROOT 10 ASRC */ \
};

const clock_name_t s_clockSourceNameMEDIA[][4] = {
    /*SRC0,                     SRC1,                     SRC2,               SRC3,                     index      name   */ \
    { kCLOCK_SRC_MEDIABUS,      kCLOCK_SRC_Invalid,       kCLOCK_SRC_Invalid, kCLOCK_SRC_Invalid },  /* MEDIA ROOT 0 MEDIA */ \
    { kCLOCK_SRC_MAINPLLDIV10,  kCLOCK_SRC_MIPIPLL_DIV8,  kCLOCK_SRC_Invalid, kCLOCK_SRC_Invalid },  /* MEDIA ROOT 1 MEDIAPLL */ \
    { kCLOCK_SRC_PERI5,         kCLOCK_SRC_VIDEOPLL,      kCLOCK_SRC_VIDEO,   kCLOCK_SRC_MEDIAPLL }, /* MEDIA ROOT 2 MIPICSI_ESCCLK */ \
    { kCLOCK_SRC_PERI5,         kCLOCK_SRC_VIDEOPLL,      kCLOCK_SRC_VIDEO,   kCLOCK_SRC_MEDIAPLL }, /* MEDIA ROOT 3 MIPICSI */ \
    { kCLOCK_SRC_PERI5,         kCLOCK_SRC_VIDEOPLL,      kCLOCK_SRC_VIDEO,   kCLOCK_SRC_MEDIAPLL }, /* MEDIA ROOT 4 MIPIDSI_ESCCLK */ \
    { kCLOCK_SRC_SXOSC,         kCLOCK_SRC_Invalid,       kCLOCK_SRC_Invalid, kCLOCK_SRC_Invalid },  /* MEDIA ROOT 5 MIPIDSI_REFCLK */ \
    { kCLOCK_SRC_PERI5,         kCLOCK_SRC_VIDEOPLL,      kCLOCK_SRC_VIDEO,   kCLOCK_SRC_MEDIAPLL }, /* MEDIA ROOT 6 MIPIDSI */ \
    { kCLOCK_SRC_PERI5,         kCLOCK_SRC_VIDEOPLL,      kCLOCK_SRC_VIDEO,   kCLOCK_SRC_MEDIAPLL }, /* MEDIA ROOT 7 REFORMAT */ \
    { kCLOCK_SRC_PERI5,         kCLOCK_SRC_VIDEOPLL,      kCLOCK_SRC_VIDEO,   kCLOCK_SRC_MEDIAPLL }, /* MEDIA ROOT 8 DCPIXEL */ \
    { kCLOCK_SRC_PERI5,         kCLOCK_SRC_SXOSC,         kCLOCK_SRC_VIDEO,   kCLOCK_SRC_MEDIAPLL }, /* MEDIA ROOT 9 CSI_MCLKOUT */ \
};

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/
static CCM_Type* locateClkRoot(clock_root_t target, uint32_t* index)
{
    CCM_Type* targetCCM = (CCM_Type*)NULL;
    *index = 0;

    // Determine which SS the clock node belongs to and its inner index
    if (target <= kCLOCK_Root_CGU_END) {
        // CGU
        targetCCM = SYSCON__CCM;
        *index = target - kCLOCK_Root_CGU_START;
    }
    else if (target >= kCLOCK_Root_CMPT_START && target <= kCLOCK_Root_CMPT_END) {
        // CMPT
        targetCCM = CMPT__CCM;
        *index = target - kCLOCK_Root_CMPT_START;
    }
    else if (target >= kCLOCK_Root_MAIN_START && target <= kCLOCK_Root_MAIN_END) {
        // MAIN
        targetCCM = MAIN__CCM;
        *index = target - kCLOCK_Root_MAIN_START;
    }
    else if (target >= kCLOCK_Root_WAKE_START && target <= kCLOCK_Root_WAKE_END) {
        // WAKE
        targetCCM = WAKE__CCM;
        *index = target - kCLOCK_Root_WAKE_START;
    }
    else if (target >= kCLOCK_Root_COMM_START && target <= kCLOCK_Root_COMM_END) {
        // COMM
        targetCCM = COMM__CCM;
        *index = target - kCLOCK_Root_COMM_START;
    }
    else if (target >= kCLOCK_Root_AUDIO_START && target <= kCLOCK_Root_AUDIO_END) {
        // AUDIO
        targetCCM = AUDIO__CCM;
        *index = target - kCLOCK_Root_AUDIO_START;
    }
    else if (target >= kCLOCK_Root_MEDIA_START && target <= kCLOCK_Root_MEDIA_END) {
        // MEDIA
        targetCCM = MEDIA__CCM;
        *index = target - kCLOCK_Root_MEDIA_START;
    }

    return targetCCM;
}

/*!
 * @brief Set CCM Root Clock MUX node to certain value.
 *
 * @param root Which root clock node to set, see \ref clock_root_t.
 * @param src Clock mux value to set, different mux has different value range. See \ref clock_root_mux_source_t.
 */
void CLOCK_SetRootClockMux(clock_root_t root, clock_root_mux_source_t src)
{
    CCM_Type* targetCCM;
    uint32_t index;
    assert(src < 4U);
    targetCCM = locateClkRoot(root, &index);
    if (targetCCM != NULL)
    {
        targetCCM->CLOCK_ROOT[index].SLICE_CONTROL =
            (targetCCM->CLOCK_ROOT[index].SLICE_CONTROL & ~(CCM_SLICE_CONTROL_MUX_MASK)) | CCM_SLICE_CONTROL_MUX(src);
        __DSB();
        __ISB();
#if __CORTEX_M == 85
        (void)targetCCM->CLOCK_ROOT[index].SLICE_CONTROL;
#endif
    }
}

/*!
 * @brief Get CCM Root Clock MUX value.
 *
 * @param root Which root clock node to get, see \ref clock_root_t.
 * @return Clock mux value.
 */
uint32_t CLOCK_GetRootClockMux(clock_root_t root)
{
    CCM_Type* targetCCM;
    uint32_t index;
    targetCCM = locateClkRoot(root, &index);
    if (NULL == targetCCM) { return 0U; }
    return (targetCCM->CLOCK_ROOT[index].STATUS0 & CCM_STATUS0_MUX_MASK) >> CCM_STATUS0_MUX_SHIFT;
}

/*!
 * @brief Get CCM Root Clock Source.
 *
 * @param root Which root clock node to get, see \ref clock_root_t.
 * @param src Clock mux value to get, see \ref clock_root_mux_source_t.
 * @return Clock source
 */
clock_name_t CLOCK_GetRootClockSource(clock_root_t root, uint32_t src)
{
    CCM_Type* targetCCM;
    uint32_t index;
    targetCCM = locateClkRoot(root, &index);
    if (targetCCM == SYSCON__CCM)
        return s_clockSourceNameCGU[index][src];
    else if (targetCCM == CMPT__CCM)
        return s_clockSourceNameCMPT[index][src];
    else if (targetCCM == MAIN__CCM)
        return s_clockSourceNameMAIN[index][src];
    else if (targetCCM == WAKE__CCM)
        return s_clockSourceNameWAKE[index][src];
    else if (targetCCM == COMM__CCM)
        return s_clockSourceNameCOMM[index][src];
    else if (targetCCM == AUDIO__CCM)
        return s_clockSourceNameAUDIO[index][src];
    else if (targetCCM == MEDIA__CCM)
        return s_clockSourceNameMEDIA[index][src];
    else
        return kCLOCK_SRC_Invalid;
}

/*!
 * @brief Set CCM Root Clock DIV certain value.
 *
 * @param root Which root clock to set, see \ref clock_root_t.
 * @param div Clock div value to set, different divider has different value range.
 */
void CLOCK_SetRootClockDiv(clock_root_t root, uint32_t div)
{
    CCM_Type* targetCCM;
    uint32_t index;

    assert(div);
    targetCCM = locateClkRoot(root, &index);
    if (targetCCM != NULL)
    {
        targetCCM->CLOCK_ROOT[index].SLICE_CONTROL =
            (targetCCM->CLOCK_ROOT[index].SLICE_CONTROL & ~CCM_SLICE_CONTROL_DIV_MASK) |
            CCM_SLICE_CONTROL_DIV((uint32_t)div - 1UL);
        __DSB();
        __ISB();
#if __CORTEX_M == 85
        (void)targetCCM->CLOCK_ROOT[index].SLICE_CONTROL;
#endif
    }
}

/*!
 * @brief Get CCM DIV node value.
 *
 * @param root Which root clock node to get, see \ref clock_root_t.
 * @return divider set for this root
 */
uint32_t CLOCK_GetRootClockDiv(clock_root_t root)
{
    CCM_Type* targetCCM;
    uint32_t index;
    targetCCM = locateClkRoot(root, &index);
    if (NULL == targetCCM) { return 0U; }
    return ((targetCCM->CLOCK_ROOT[index].STATUS0 & CCM_STATUS0_DIV_MASK) >> CCM_STATUS0_DIV_SHIFT) + 1UL;
}

/*!
 * @brief Power Off Root Clock
 *
 * @param root Which root clock node to set, see \ref clock_root_t.
 */
void CLOCK_PowerOffRootClock(clock_root_t root)
{
    CCM_Type* targetCCM;
    uint32_t index;
    targetCCM = locateClkRoot(root, &index);
    if (targetCCM != NULL)
    {
        if (0UL == (targetCCM->CLOCK_ROOT[index].STATUS0 & CCM_STATUS0_OFF_MASK))
        {
            targetCCM->CLOCK_ROOT[index].SLICE_CONTROL |= CCM_SLICE_CONTROL_SHUTDOWN_MASK;
            __DSB();
            __ISB();
#if __CORTEX_M == 85
            (void)targetCCM->CLOCK_ROOT[index].SLICE_CONTROL;
#endif
        }
    }
}

/*!
 * @brief Power On Root Clock
 *
 * @param root Which root clock node to set, see \ref clock_root_t.
 */
void CLOCK_PowerOnRootClock(clock_root_t root)
{
    CCM_Type* targetCCM;
    uint32_t index;
    targetCCM = locateClkRoot(root, &index);
    if (targetCCM != NULL)
    {
        targetCCM->CLOCK_ROOT[index].SLICE_CONTROL &= ~CCM_SLICE_CONTROL_SHUTDOWN_MASK;
        __DSB();
        __ISB();
#if __CORTEX_M == 85
        (void)targetCCM->CLOCK_ROOT[index].SLICE_CONTROL;
#endif
    }
}

/*!
 * @brief Configure Root Clock
 *
 * @param root Which root clock node to set, see \ref clock_root_t.
 * @param config root clock config, see \ref clock_root_config_t
 */
void CLOCK_SetRootClock(clock_root_t root, const clock_root_config_t *config)
{
    CCM_Type* targetCCM;
    uint32_t index;

    bool secondDivPresent;
    bool glitchFree;
    bool curPowerState;
    uint32_t status0, status1, curDiv, curSndDiv, newDiv, newSndDiv;
    uint32_t sliceCtrl;

    assert(config);
    targetCCM = locateClkRoot(root, &index);
    if (targetCCM != NULL)
    {
        /* Divider fields in SLICE_CONTROL and STATUS0 are (actual - 1); compare raw
         * register values so the sequencing below is straightforward. */
        status0          = targetCCM->CLOCK_ROOT[index].STATUS0;
        status1          = targetCCM->CLOCK_ROOT[index].STATUS1;
        curDiv           = (status0 & CCM_STATUS0_DIV_MASK)     >> CCM_STATUS0_DIV_SHIFT;
        curSndDiv        = (status0 & CCM_STATUS0_SND_DIV_MASK) >> CCM_STATUS0_SND_DIV_SHIFT;
        secondDivPresent = (status1 & CCM_STATUS1_SECOND_DIVIDER_PRESENT_MASK) != 0UL;
        glitchFree       = (status1 & CCM_STATUS1_GLITCH_FREE_MASK) != 0UL;
        curPowerState    = (status0 & CCM_STATUS0_OFF_MASK) == 0UL;
        newDiv           = (uint32_t)config->div    - 1UL;
        newSndDiv        = (config->sndDiv == 0) ? 0 : (uint32_t)config->sndDiv - 1UL;

        /* For non-glitch-free roots that are currently running, gate the clock before
         * touching MUX/DIV to avoid glitches on the output.  Skip this when the root
         * is already shut down (curPowerState == 0) since gating an already-off clock
         * achieves nothing.  Update curPowerState to reflect the gated state so the
         * final SHUTDOWN step can use it to decide whether to open or keep closed. */
        if (!glitchFree && curPowerState)
        {
            sliceCtrl = targetCCM->CLOCK_ROOT[index].SLICE_CONTROL;
            targetCCM->CLOCK_ROOT[index].SLICE_CONTROL = sliceCtrl | CCM_SLICE_CONTROL_SHUTDOWN_MASK;
            curPowerState = false;
        }

        /* Grow dividers BEFORE the mux change; shrink AFTER. This keeps the output
         * frequency at or below the target across the mux transition and prevents
         * the surge that a single-write mux+div update can cause. */
        if (secondDivPresent && (newSndDiv > curSndDiv))
        {
            sliceCtrl = targetCCM->CLOCK_ROOT[index].SLICE_CONTROL;
            targetCCM->CLOCK_ROOT[index].SLICE_CONTROL =
                (sliceCtrl & ~CCM_SLICE_CONTROL_SND_DIV_MASK) | CCM_SLICE_CONTROL_SND_DIV(newSndDiv);
        }

