zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.c
        if (newDiv > curDiv)
        {
            sliceCtrl = targetCCM->CLOCK_ROOT[index].SLICE_CONTROL;
            targetCCM->CLOCK_ROOT[index].SLICE_CONTROL =
                (sliceCtrl & ~CCM_SLICE_CONTROL_DIV_MASK) | CCM_SLICE_CONTROL_DIV(newDiv);
        }

        sliceCtrl = targetCCM->CLOCK_ROOT[index].SLICE_CONTROL;
        targetCCM->CLOCK_ROOT[index].SLICE_CONTROL =
            (sliceCtrl & ~CCM_SLICE_CONTROL_MUX_MASK) | CCM_SLICE_CONTROL_MUX(config->mux);

        if (newDiv < curDiv)
        {
            sliceCtrl = targetCCM->CLOCK_ROOT[index].SLICE_CONTROL;
            targetCCM->CLOCK_ROOT[index].SLICE_CONTROL =
                (sliceCtrl & ~CCM_SLICE_CONTROL_DIV_MASK) | CCM_SLICE_CONTROL_DIV(newDiv);
        }

        if (secondDivPresent && (newSndDiv < curSndDiv))
        {
            sliceCtrl = targetCCM->CLOCK_ROOT[index].SLICE_CONTROL;
            targetCCM->CLOCK_ROOT[index].SLICE_CONTROL =
                (sliceCtrl & ~CCM_SLICE_CONTROL_SND_DIV_MASK) | CCM_SLICE_CONTROL_SND_DIV(newSndDiv);
        }

        sliceCtrl = targetCCM->CLOCK_ROOT[index].SLICE_CONTROL;
        /* Use config->clockShutdown and curPowerState (which reflects the gated
         * state after the pre-MUX/DIV step above) to decide the final SHUTDOWN:
         *   - clockShutdown=1, curPowerState=1: want off, currently on  -> assert SHUTDOWN.
         *   - clockShutdown=0, curPowerState=0: want on,  currently off -> clear SHUTDOWN.
         *   - clockShutdown=1, curPowerState=0: already off, stay off   -> no action.
         *   - clockShutdown=0, curPowerState=1: already on, stay on     -> no action. */
        if (config->clockShutdown == curPowerState)
        {
            if (config->clockShutdown)
            {
                sliceCtrl |= CCM_SLICE_CONTROL_SHUTDOWN_MASK;
            }
            else
            {
                sliceCtrl &= ~CCM_SLICE_CONTROL_SHUTDOWN_MASK;
            }
        }
        targetCCM->CLOCK_ROOT[index].SLICE_CONTROL = sliceCtrl;

        __DSB();
        __ISB();
#if __CORTEX_M == 85
        (void)targetCCM->CLOCK_ROOT[index].SLICE_CONTROL;
#endif
    }
}

/*******************************************************************************
 * MODCON-controlled clock-tree muxes (MCUX-88602)
 *
 * Set-side counterpart to the Case-3 / OSC_24M branches of
 * CLOCK_GetClockSrcFreq. The canonical MODCON instance for each Mx must match
 * what the Get path reads so all readers see the same /2 selection -- see the
 * shared-Mx note above s_clockSrcRootMap.
 ******************************************************************************/

void CLOCK_SetOsc24mSource(clock_osc_24m_src_t src)
{
    uint32_t cfg = MODCON_GetCFG((uint32_t)kModCon_MAIN_CLK24M_SEL, 0U);
    cfg = (cfg & ~MODCON_CFG_SEL_MASK) | MODCON_CFG_SEL((uint32_t)src);
    MODCON_SetCFG((uint32_t)kModCon_MAIN_CLK24M_SEL, 0U, cfg);
}

clock_osc_24m_src_t CLOCK_GetOsc24mSource(void)
{
    uint32_t cfg = MODCON_GetCFG((uint32_t)kModCon_MAIN_CLK24M_SEL, 0U);
    return ((cfg & MODCON_CFG_SEL_MASK) == 0U) ? kCLOCK_Osc24mSrc_FRO_24M : kCLOCK_Osc24mSrc_SXOSC;
}

static bool clockSrcDiv2Lookup(clock_name_t src, uint32_t *modcon, uint32_t *mask)
{
    switch (src)
    {
        case kCLOCK_SRC_MAIN_PERI0_DIV2:
            *modcon = (uint32_t)kModCon_MAIN_XSPI0;
            *mask   = MODCON_CFG_PERI_ROOTCLK0_MASK;
            return true;
        case kCLOCK_SRC_MAIN_PERI1_DIV2:
            *modcon = (uint32_t)kModCon_MAIN_XSPI1;
            *mask   = MODCON_CFG_PERI_ROOTCLK1_MASK;
            return true;
        case kCLOCK_SRC_MAINPFDX_DIV2:
            /* Shared XSPI0/XSPI1 source -- XSPI0 is the canonical instance. */
            *modcon = (uint32_t)kModCon_MAIN_XSPI0;
            *mask   = MODCON_CFG_MAINPFDX_ROOTCLK_MASK;
            return true;
        case kCLOCK_SRC_COMM_PERI1_DIV2:
            *modcon = (uint32_t)kModCon_COMM_USDHC0;
            *mask   = MODCON_CFG_PERI_ROOTCLK1_SEL_DIV2_MASK;
            return true;
        case kCLOCK_SRC_COMM_PERI2_DIV2:
            *modcon = (uint32_t)kModCon_COMM_USDHC1;
            *mask   = MODCON_CFG_PERI_ROOTCLK2_SEL_DIV2_MASK;
            return true;
        case kCLOCK_SRC_COMMPFDX_DIV2:
            /* Shared USDHC0/USDHC1 source -- USDHC0 is the canonical instance. */
            *modcon = (uint32_t)kModCon_COMM_USDHC0;
            *mask   = MODCON_CFG_COMMPFDX_ROOTCLK_SEL_DIV2_MASK;
            return true;
        default:
            return false;
    }
}

void CLOCK_SetClockSrcDiv2(clock_name_t src, bool useDiv2)
{
    uint32_t modcon = 0U, mask = 0U, cfg;

    if (!clockSrcDiv2Lookup(src, &modcon, &mask))
    {
        return;
    }
    cfg = MODCON_GetCFG(modcon, 0U);
    if (useDiv2)
    {
        cfg |= mask;
    }
    else
    {
        cfg &= ~mask;
    }
    MODCON_SetCFG(modcon, 0U, cfg);
}

bool CLOCK_GetClockSrcDiv2(clock_name_t src)
{
    uint32_t modcon = 0U, mask = 0U;

    if (!clockSrcDiv2Lookup(src, &modcon, &mask))
    {
        return false;
    }
    return (MODCON_GetCFG(modcon, 0U) & mask) != 0U;
}

static CCM_Type* locateClkGate(clock_ip_name_t target, uint32_t* index)
{
    CCM_Type* targetCCM = (CCM_Type*)NULL;
    /* Safe default: 0 sits inside every CCM's CGC_ROOT[] array. All valid
     * subsystem branches below reassign *index; for out-of-range targets
     * (e.g. kCLOCK_IpInvalid) the value stays bounded. Setting an
     * unconditional default of (target - kCLOCK_MAIN_START) at entry
     * confuses -Werror=array-bounds analysis, which then reports 172 as a
     * reachable subscript when no branch matches. */
    *index = 0U;

    // Determine which SS the clock node belongs to and its inner index
    if (target <= kCLOCK_SYSCON_END) {
        // SYSCON
        targetCCM = SYSCON__CCM;
        *index = target - kCLOCK_SYSCON_START;
    }
    else if (target >= kCLOCK_CMPT_START && target <= kCLOCK_CMPT_END) {
        // CMPT
        targetCCM = CMPT__CCM;
        *index = target - kCLOCK_CMPT_START;
    }
    else if (target >= kCLOCK_MAIN_START && target <= kCLOCK_MAIN_END) {
        // MAIN
        targetCCM = MAIN__CCM;
        *index = target - kCLOCK_MAIN_START;
    }
    else if (target >= kCLOCK_WAKE_START && target <= kCLOCK_WAKE_END) {
        // WAKE
        targetCCM = WAKE__CCM;
        *index = target - kCLOCK_WAKE_START;
    }
    else if (target >= kCLOCK_COMM_START && target <= kCLOCK_COMM_END) {
        // COMM
        targetCCM = COMM__CCM;
        *index = target - kCLOCK_COMM_START;
    }
    else if (target >= kCLOCK_AUDIO_START && target <= kCLOCK_AUDIO_END) {
        // AUDIO
        targetCCM = AUDIO__CCM;
        *index = target - kCLOCK_AUDIO_START;
    }
    else if (target >= kCLOCK_MEDIA_START && target <= kCLOCK_MEDIA_END) {
        // MEDIA
        targetCCM = MEDIA__CCM;
        *index = target - kCLOCK_MEDIA_START;
    }
    return targetCCM;
}

/*!
 * @brief Enable the clock for specific IP.
 *
 * @param name  Which clock to enable, see \ref clock_lpcg_t.
 */
void CLOCK_EnableClock(clock_ip_name_t name)
{
    CCM_Type* targetCCM;
    uint32_t index;
    /* Instances without an LPCG (e.g. VBAT__GPIO, VBAT__LPTMR) use
     * kCLOCK_IpInvalid in the per-IP clock arrays; locateClkGate() has no
     * mapping for it and would produce a stray register write. */
    if (name == kCLOCK_IpInvalid)
    {
        return;
    }
    targetCCM = locateClkGate(name, &index);
    if (targetCCM != NULL)
    {
        targetCCM->CGC_ROOT[index].SLICE_CONTROL |= CCM_SLICE_CONTROL_LPCG_CFG_MASK;
    }
}

/*!
 * @brief Disable the clock for specific IP.
 *
 * @param name  Which clock to disable, see \ref clock_lpcg_t.
 */
void CLOCK_DisableClock(clock_ip_name_t name)
{
    CCM_Type* targetCCM;
    uint32_t index;
    if (name == kCLOCK_IpInvalid)
    {
        return;
    }
    targetCCM = locateClkGate(name, &index);
    if (targetCCM != NULL)
    {
        targetCCM->CGC_ROOT[index].SLICE_CONTROL &= ~CCM_SLICE_CONTROL_LPCG_CFG_MASK;
    }
}

/*!
 * @brief Program LPCG_CFG, HSK_SEL, and HSK_BYPASS of a peripheral clock gate.
 */
void CLOCK_SetClockGateMode(clock_ip_name_t name, clock_gate_value_t mode, uint8_t hskSel,
                            bool bypassHandshake)
{
    CCM_Type* targetCCM;
    uint32_t  index;
    uint32_t  clearMask;
    uint32_t  setMask;

    if (name == kCLOCK_IpInvalid)
    {
        return;
    }
    targetCCM = locateClkGate(name, &index);
    if (targetCCM != NULL)
    {
        clearMask = CCM_SLICE_CONTROL_LPCG_CFG_MASK |
                    CCM_SLICE_CONTROL_HSK_SEL_MASK  |
                    CCM_SLICE_CONTROL_HSK_BYPASS_MASK;
        setMask   = CCM_SLICE_CONTROL_LPCG_CFG((uint32_t)mode) |
                    CCM_SLICE_CONTROL_HSK_SEL((uint32_t)hskSel) |
                    (bypassHandshake ? CCM_SLICE_CONTROL_HSK_BYPASS(1U) : 0U);

