zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.c
        targetCCM->CGC_ROOT[index].SLICE_CONTROL =
            (targetCCM->CGC_ROOT[index].SLICE_CONTROL & ~clearMask) | setMask;
    }
}

/*******************************************************************************
 * CGUANA driver
 ******************************************************************************/

static const uint32_t s_cguanaRefFreq[4] = {19200000U, 24000000U, 32000000U, 40000000U};

/* 
 * Turn on one or more FSM-controlled resources and wait until they are ready.
 * fsmBits: one or more CLOCK_CGUANA_FSM_xxx bits (must NOT include FRO12M_WAKE). 
 *      0    LDOA 0.8 V
 *      1    FRO192M
 *      2    FRO12M
 *      3    MAINPLL
 *      4    COREPLL
 *      5    SYSPLL
 *      6    LDOQ 0.8 V
 *      7    SXOSC
 *      8    FRO12M_LP
 */
static void CGUANA_FsmOn(uint32_t fsmBits)
{
#if 1
    /* Original path: drive the CGUANA FSM directly via CGUAD_CTRL_REG. */
    uint32_t reg = SYSCON__CGUANA->CGUAD_CTRL_REG;
    reg &= ~CGUANA_CGUAD_CTRL_REG_CGUAD_FSM_SW_OFF_REQ(fsmBits);
    reg |= CGUANA_CGUAD_CTRL_REG_CGUAD_FSM_SW_ON_REQ(fsmBits);
    SYSCON__CGUANA->CGUAD_CTRL_REG = reg;
    /* Wait for all requested RDY bits (FRO12M_WAKE bit8 has no RDY) */
    uint32_t rdyMask = fsmBits & CGUANA_CGUAD_CTRL_STS_CGUAD_FSM_RDY_MASK;
    while ((SYSCON__CGUANA->CGUAD_CTRL_STS & rdyMask) != rdyMask) {}
#else
    /* Alternative path: use POWERCON P_TRIG */
    uint32_t csrc = SYSCON__POWERCON_SOC_CTRL->CSRCCFG_ACTIVE;
    csrc |= (fsmBits & POWERCON_SOC_CTRL_CSRCCFG_ACTIVE_CFG_ACTIVE_MASK);
    SYSCON__POWERCON_SOC_CTRL->CSRCCFG_ACTIVE = csrc;
    /* Fire the P-Channel handshake to PMU/CGUANA. */
    SYSCON__POWERCON_SOC_CTRL->SOC_CTRL_STATUS |= POWERCON_SOC_CTRL_SOC_CTRL_STATUS_P_TRG_MASK;
    /* Wait for the P-Channel update to complete (P_OVER). */
    while ((SYSCON__POWERCON_SOC_CTRL->SOC_CTRL_STATUS &
            POWERCON_SOC_CTRL_SOC_CTRL_STATUS_P_OVER_MASK) == 0U) {}
    /* Wait for all requested RDY bits (FRO12M_WAKE bit8 has no RDY). */
    uint32_t rdyMask = fsmBits & CGUANA_CGUAD_CTRL_STS_CGUAD_FSM_RDY_MASK;
    while ((SYSCON__CGUANA->CGUAD_CTRL_STS & rdyMask) != rdyMask) {}
#endif
}

/* Turn off one or more FSM-controlled resources. */
static void CGUANA_FsmOff(uint32_t fsmBits)
{
    uint32_t reg = SYSCON__CGUANA->CGUAD_CTRL_REG;
    reg &= ~CGUANA_CGUAD_CTRL_REG_CGUAD_FSM_SW_ON_REQ(fsmBits);
    reg |= CGUANA_CGUAD_CTRL_REG_CGUAD_FSM_SW_OFF_REQ(fsmBits);
    SYSCON__CGUANA->CGUAD_CTRL_REG = reg;
}

void CLOCK_SetCmsPllRefSource(clock_pll_ref_src_t src)
{
    uint32_t reg = SYSCON__CGUANA->CGUA_CTRL_REG;
    reg &= ~CGUANA_CGUA_CTRL_REG_CGUA_CLKGEN_CMS_PLL_CKIN_SEL_MASK;
    reg |= CGUANA_CGUA_CTRL_REG_CGUA_CLKGEN_CMS_PLL_CKIN_SEL((uint32_t)src);
    SYSCON__CGUANA->CGUA_CTRL_REG = reg;
}

clock_pll_ref_src_t CLOCK_GetCmsPllRefSource(void)
{
    return ((SYSCON__CGUANA->CGUA_CTRL_REG & CGUANA_CGUA_CTRL_REG_CGUA_CLKGEN_CMS_PLL_CKIN_SEL_MASK) != 0U)
               ? kCLOCK_PllRefSrc_SXOSC
               : kCLOCK_PllRefSrc_FRO192M_24M;
}

void CLOCK_SetAvPllRefSource(clock_pll_ref_src_t src)
{
    uint32_t reg = SYSCON__CGUANA->CGUA_CTRL_REG;
    reg &= ~CGUANA_CGUA_CTRL_REG_CGUA_CLKGEN_AV_PLL_CKIN_SEL_MASK;
    reg |= CGUANA_CGUA_CTRL_REG_CGUA_CLKGEN_AV_PLL_CKIN_SEL((uint32_t)src);
    SYSCON__CGUANA->CGUA_CTRL_REG = reg;
}

clock_pll_ref_src_t CLOCK_GetAvPllRefSource(void)
{
    return ((SYSCON__CGUANA->CGUA_CTRL_REG & CGUANA_CGUA_CTRL_REG_CGUA_CLKGEN_AV_PLL_CKIN_SEL_MASK) != 0U)
               ? kCLOCK_PllRefSrc_SXOSC
               : kCLOCK_PllRefSrc_FRO192M_24M;
}

/* Shared helper: program Main/Sys PLL control registers (identical layouts).
 * Uses MAINPLL macro names -- bit patterns are identical for SYSPLL. */
static void CGUANA_ConfigFracPllRegs(
    volatile uint32_t *pll1Reg, volatile uint32_t *pll2Reg,
    volatile uint32_t *pll3Reg, volatile uint32_t *pll4Reg,
    const clock_cguana_frac_pll_config_t *config)
{
    *pll1Reg =
        (config->div5En  ? CGUANA_CGUA_MAINPLL_PLL1_REG_MAINPLL_DIV5_EN_MASK  : 0U) |
        (config->div8En  ? CGUANA_CGUA_MAINPLL_PLL1_REG_MAINPLL_DIV8_EN_MASK  : 0U) |
        (config->div10En ? CGUANA_CGUA_MAINPLL_PLL1_REG_MAINPLL_DIV10_EN_MASK : 0U) |
        (config->div20En ? CGUANA_CGUA_MAINPLL_PLL1_REG_MAINPLL_DIV20_EN_MASK : 0U);

    *pll2Reg =
        (config->fracDiv[0].en    ? CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC0_EN_MASK    : 0U) |
        (config->fracDiv[0].range ? CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC0_RANGE_MASK : 0U) |
        CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC0_SEL(config->fracDiv[0].sel) |
        (config->fracDiv[1].en    ? CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC1_EN_MASK    : 0U) |
        (config->fracDiv[1].range ? CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC1_RANGE_MASK : 0U) |
        CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC1_SEL(config->fracDiv[1].sel) |
        (config->fracDiv[2].en    ? CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC2_EN_MASK    : 0U) |
        (config->fracDiv[2].range ? CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC2_RANGE_MASK : 0U) |
        CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC2_SEL(config->fracDiv[2].sel);

    *pll3Reg =
        CGUANA_CGUA_MAINPLL_PLL3_REG_MAINPLL_FREF_SET((uint32_t)config->refFreq) |
        CGUANA_CGUA_MAINPLL_PLL3_REG_MAINPLL_LOWFREQ(config->lowFreq);

    uint32_t pll4 = 0U;
    if (config->sscgEn)
    {
        pll4 |= CGUANA_CGUA_MAINPLL_PLL4_REG_MAINPLL_SSCG_EN_MASK;
        if (config->sscg != NULL)
        {
            pll4 |= CGUANA_CGUA_MAINPLL_PLL4_REG_MAINPLL_SSCG_STOP(config->sscg->stop) |
                    CGUANA_CGUA_MAINPLL_PLL4_REG_MAINPLL_SSCG_STEP(config->sscg->step) |
                    (config->sscg->centerSpread ?
                        CGUANA_CGUA_MAINPLL_PLL4_REG_MAINPLL_SSCG_SPREAD_MODE_MASK : 0U);
        }
    }
    *pll4Reg = pll4;
}

/* Per-fractional-output (DIVOUT0..2) DIVFRAC SEL/RANGE field descriptors,
 * indexed by fracIdx (0..2). MainPLL and SysPLL share the same PLL2 layout,
 * so a single descriptor table covers both. */
typedef struct
{
    uint32_t selMask;
    uint32_t selShift;
    uint32_t rangeMask;
} cguana_main_sys_pll_divfrac_desc_t;

static const cguana_main_sys_pll_divfrac_desc_t s_mainSysPllDivFracDesc[3] = {
    {
        CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC0_SEL_MASK,
        CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC0_SEL_SHIFT,
        CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC0_RANGE_MASK,
    },
    {
        CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC1_SEL_MASK,
        CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC1_SEL_SHIFT,
        CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC1_RANGE_MASK,
    },
    {
        CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC2_SEL_MASK,
        CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC2_SEL_SHIFT,
        CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC2_RANGE_MASK,
    },
};

