zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.c
/* Base VCO frequency for the four LOWFREQ band-select values, indexed by the
 * MAINPLL_LOWFREQ field value (0..3). */
static const uint32_t s_mainSysPllVcoFreq[4] = {
    2000000000U, 1950000000U, 1900000000U, 1850000000U
};

/* Read the VCO frequency from a frac PLL's PLL3 register (LOWFREQ band select). */
static uint32_t CGUANA_GetFracPllVcoFreq(volatile const uint32_t *pll3Reg)
{
    return s_mainSysPllVcoFreq[
        (*pll3Reg & CGUANA_CGUA_MAINPLL_PLL3_REG_MAINPLL_LOWFREQ_MASK) >>
        CGUANA_CGUA_MAINPLL_PLL3_REG_MAINPLL_LOWFREQ_SHIFT];
}

/* Compute one of the fractional outputs (DIVOUT0..2) of a frac PLL, given the
 * already-computed VCO frequency and the consuming output index (0..2). */
static uint32_t CGUANA_GetFracPllDivOutFreq(
    uint32_t vco, volatile const uint32_t *pll2Reg, uint8_t fracIdx)
{
    const cguana_main_sys_pll_divfrac_desc_t *desc = &s_mainSysPllDivFracDesc[fracIdx];
    uint32_t pll2  = *pll2Reg;
    uint32_t sel   = (pll2 & desc->selMask) >> desc->selShift;
    uint32_t range = ((pll2 & desc->rangeMask) != 0U) ? 1U : 0U;

    if (range != 0U)
    {
        sel += 32U;
    }
    if (sel == 0U)
    {
        return 0U;
    }
    return (uint32_t)((uint64_t)vco * 4U / sel);
}


void CLOCK_InitSxosc(const clock_cguana_sxosc_config_t *config)
{
    assert(config != NULL);
    SYSCON__CGUANA->CGUA_SXOSC_CTRL_REG =
        CGUANA_CGUA_SXOSC_CTRL_REG_SXOSC_MODE_SEL(config->modeSel)              |
        CGUANA_CGUA_SXOSC_CTRL_REG_SXOSC_GM_SEL(config->gmSel)                  |
        CGUANA_CGUA_SXOSC_CTRL_REG_SXOSC_XTAL1_CAP_TRIM(config->xtal1CapTrim)   |
        CGUANA_CGUA_SXOSC_CTRL_REG_SXOSC_XTAL2_CAP_TRIM(config->xtal2CapTrim)   |
        CGUANA_CGUA_SXOSC_CTRL_REG_SXOSC_DET_TRIM(config->detTrim)              |
        (config->clkDiv2En ? CGUANA_CGUA_SXOSC_CTRL_REG_SXOSC_CLK_DIV2_EN_MASK : 0U);
    CGUANA_FsmOn(CLOCK_CGUANA_FSM_SXOSC);
}

void CLOCK_DeinitSxosc(void)
{
    CGUANA_FsmOff(CLOCK_CGUANA_FSM_SXOSC);
}

void CLOCK_InitFro192M(const clock_cguana_fro192m_config_t *config)
{
    assert(config != NULL);
    uint32_t reg = SYSCON__CGUANA->CGUA_FRO192M_CTRL_REG;
    reg &= ~CGUANA_CGUA_FRO192M_CTRL_REG_FRO192M_OTWB_MASK;
    reg |= CGUANA_CGUA_FRO192M_CTRL_REG_FRO192M_OTWB(config->otwb);
    SYSCON__CGUANA->CGUA_FRO192M_CTRL_REG = reg;
    CGUANA_FsmOn(CLOCK_CGUANA_FSM_FRO192M);
}

void CLOCK_DeinitFro192M(void)
{
    CGUANA_FsmOff(CLOCK_CGUANA_FSM_FRO192M);
}

void CLOCK_InitFro12M(const clock_cguana_fro12m_config_t *config)
{
    assert(config != NULL);
    uint32_t reg = SYSCON__CGUANA->CGUA_FRO12M_CTRL_REG;
    reg &= ~CGUANA_CGUA_FRO12M_CTRL_REG_FRO12M_OTWB_MASK;
    reg |= CGUANA_CGUA_FRO12M_CTRL_REG_FRO12M_OTWB(config->otwb);
    SYSCON__CGUANA->CGUA_FRO12M_CTRL_REG = reg;
    CGUANA_FsmOn(CLOCK_CGUANA_FSM_FRO12M);
}

void CLOCK_DeinitFro12M(void)
{
    CGUANA_FsmOff(CLOCK_CGUANA_FSM_FRO12M);
}

void CLOCK_InitCorePll(const clock_cguana_core_pll_config_t *config)
{
    assert(config != NULL);

    SYSCON__CGUANA->CGUA_COREPLL_PLL2_REG =
        (config->vcoSelHf ? CGUANA_CGUA_COREPLL_PLL2_REG_COREPLL_VCO_SEL_MASK : 0U) |
        CGUANA_CGUA_COREPLL_PLL2_REG_COREPLL_FREF_SET((uint32_t)config->refFreq)    |
        CGUANA_CGUA_COREPLL_PLL2_REG_COREPLL_LOOPDIV_NINT(config->loopDivNint)      |
        (config->postDivBy2 ? CGUANA_CGUA_COREPLL_PLL2_REG_COREPLL_POSTDIV_DIVRATIO_MASK : 0U);

    CGUANA_FsmOn(CLOCK_CGUANA_FSM_COREPLL);
}

void CLOCK_DeinitCorePll(void)
{
    CGUANA_FsmOff(CLOCK_CGUANA_FSM_COREPLL);
}

uint32_t CLOCK_GetCorePllFreq(void)
{
    uint32_t pll2   = SYSCON__CGUANA->CGUA_COREPLL_PLL2_REG;
    uint32_t fref   = s_cguanaRefFreq[
        (pll2 & CGUANA_CGUA_COREPLL_PLL2_REG_COREPLL_FREF_SET_MASK) >>
        CGUANA_CGUA_COREPLL_PLL2_REG_COREPLL_FREF_SET_SHIFT];
    uint32_t nint   = (pll2 & CGUANA_CGUA_COREPLL_PLL2_REG_COREPLL_LOOPDIV_NINT_MASK) >>
                      CGUANA_CGUA_COREPLL_PLL2_REG_COREPLL_LOOPDIV_NINT_SHIFT;
    uint32_t vco    = fref * nint;
    return ((pll2 & CGUANA_CGUA_COREPLL_PLL2_REG_COREPLL_POSTDIV_DIVRATIO_MASK) != 0U) ?
           (vco / 2U) : vco;
}

void CLOCK_InitMainPll(const clock_cguana_frac_pll_config_t *config)
{
    assert(config != NULL);
    CGUANA_ConfigFracPllRegs(
        &SYSCON__CGUANA->CGUA_MAINPLL_PLL1_REG,
        &SYSCON__CGUANA->CGUA_MAINPLL_PLL2_REG,
        &SYSCON__CGUANA->CGUA_MAINPLL_PLL3_REG,
        &SYSCON__CGUANA->CGUA_MAINPLL_PLL4_REG,
        config);
    CGUANA_FsmOn(CLOCK_CGUANA_FSM_MAINPLL);
}

void CLOCK_DeinitMainPll(void)
{
    CGUANA_FsmOff(CLOCK_CGUANA_FSM_MAINPLL);
}

uint32_t CLOCK_GetMainPllVcoFreq(void)
{
    return CGUANA_GetFracPllVcoFreq(&SYSCON__CGUANA->CGUA_MAINPLL_PLL3_REG);
}

uint32_t CLOCK_GetMainPllFreq(uint8_t fracIdx)
{
    return CGUANA_GetFracPllDivOutFreq(
        CLOCK_GetMainPllVcoFreq(),
        &SYSCON__CGUANA->CGUA_MAINPLL_PLL2_REG,
        fracIdx);
}

void CLOCK_InitSysPll(const clock_cguana_frac_pll_config_t *config)
{
    assert(config != NULL);
    CGUANA_ConfigFracPllRegs(
        &SYSCON__CGUANA->CGUA_SYSPLL_PLL1_REG,
        &SYSCON__CGUANA->CGUA_SYSPLL_PLL2_REG,
        &SYSCON__CGUANA->CGUA_SYSPLL_PLL3_REG,
        &SYSCON__CGUANA->CGUA_SYSPLL_PLL4_REG,
        config);
    CGUANA_FsmOn(CLOCK_CGUANA_FSM_SYSPLL);
}

void CLOCK_DeinitSysPll(void)
{
    CGUANA_FsmOff(CLOCK_CGUANA_FSM_SYSPLL);
}

uint32_t CLOCK_GetSysPllVcoFreq(void)
{
    return CGUANA_GetFracPllVcoFreq(&SYSCON__CGUANA->CGUA_SYSPLL_PLL3_REG);
}

uint32_t CLOCK_GetSysPllFreq(uint8_t fracIdx)
{
    return CGUANA_GetFracPllDivOutFreq(
        CLOCK_GetSysPllVcoFreq(),
        &SYSCON__CGUANA->CGUA_SYSPLL_PLL2_REG,
        fracIdx);
}

/* Shared internal init for Audio/Video PLLs (not FSM-controlled). */
static void CGUANA_InitAvPll(
    volatile uint32_t *pll1Reg, volatile uint32_t *pll3Reg,
    volatile uint32_t *pll4Reg, volatile uint32_t *dnumReg,
    volatile const uint32_t *stsReg,
    const clock_cguana_avpll_config_t *config)
{
    /* Clear PWREN/PLL_EN/RSTN/CLKOUT_EN before reconfiguring */
    *pll1Reg &= ~(CGUANA_CGUA_AUDIOPLL_PLL1_REG_AUDIOPLL_CLKOUT_EN_MASK |
                  CGUANA_CGUA_AUDIOPLL_PLL1_REG_AUDIOPLL_PLL_EN_MASK    |
                  CGUANA_CGUA_AUDIOPLL_PLL1_REG_AUDIOPLL_RSTN_MASK      |
                  CGUANA_CGUA_AUDIOPLL_PLL1_REG_AUDIOPLL_PWREN_MASK);

