zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.c
    /* Configure PLL parameters */
    *pll1Reg |=
        CGUANA_CGUA_AUDIOPLL_PLL1_REG_AUDIOPLL_FREF_SET((uint32_t)config->refFreq)             |
        CGUANA_CGUA_AUDIOPLL_PLL1_REG_AUDIOPLL_CCO_FREQ_BAND_SEL(config->ccoBandSel);

    /* SSCG configuration */
    uint32_t pll3 = 0U;
    uint32_t pll4 = CGUANA_CGUA_AUDIOPLL_PLL4_REG_AUDIOPLL_POSTDIV_DIVRATIO_SEL(config->postDivRatio);
    if (config->sscgEn && config->sscg != NULL)
    {
        pll3 = CGUANA_CGUA_AUDIOPLL_PLL3_REG_AUDIOPLL_SSCG_STOP(config->sscg->stop) |
               CGUANA_CGUA_AUDIOPLL_PLL3_REG_AUDIOPLL_SSCG_STEP(config->sscg->step) |
               (config->sscg->centerSpread ?
                   CGUANA_CGUA_AUDIOPLL_PLL3_REG_AUDIOPLL_SSCG_SPREAD_MODE_MASK : 0U);
        pll4 |= CGUANA_CGUA_AUDIOPLL_PLL4_REG_AUDIOPLL_SSCG_EN_MASK;
    }
    *pll3Reg = pll3;
    *pll4Reg = pll4;

    /* Write DNUM (no update-req needed at startup; PLL hasn't started yet) */
    *dnumReg = CGUANA_CGUA_AUDIOPLL_DNUM_REG_AUDIOPLL_DNUM(config->dnum);

    /* Power on sequence: PWREN -> wait PWRACK -> RSTN=1 -> PLL_EN=1 -> wait READY */
    *pll1Reg |= CGUANA_CGUA_AUDIOPLL_PLL1_REG_AUDIOPLL_PWREN_MASK;
    while ((*stsReg & CGUANA_CGUA_AUDIOPLL_STS_AUDIOPLL_PWRACK_MASK) == 0U) {}

    *pll1Reg |= CGUANA_CGUA_AUDIOPLL_PLL1_REG_AUDIOPLL_RSTN_MASK;
    *pll1Reg |= CGUANA_CGUA_AUDIOPLL_PLL1_REG_AUDIOPLL_PLL_EN_MASK;
    while ((*stsReg & CGUANA_CGUA_AUDIOPLL_STS_AUDIOPLL_READY_MASK) == 0U) {}

    *pll1Reg |= CGUANA_CGUA_AUDIOPLL_PLL1_REG_AUDIOPLL_CLKOUT_EN_MASK;
}

/* Shared internal deinit for Audio/Video PLLs. */
static void CGUANA_DeinitAvPll(volatile uint32_t *pll1Reg)
{
    *pll1Reg &= ~(CGUANA_CGUA_AUDIOPLL_PLL1_REG_AUDIOPLL_CLKOUT_EN_MASK |
                  CGUANA_CGUA_AUDIOPLL_PLL1_REG_AUDIOPLL_PLL_EN_MASK    |
                  CGUANA_CGUA_AUDIOPLL_PLL1_REG_AUDIOPLL_RSTN_MASK      |
                  CGUANA_CGUA_AUDIOPLL_PLL1_REG_AUDIOPLL_PWREN_MASK);
}

/* Shared internal GetFreq for Audio/Video PLLs.
 *
 * The band selects a nominal target VCO frequency F_cal around which DNUM
 * provides fine adjustment referenced to Fref:
 *   1. F_cal = F_BASE + band * D_BAND     (F_BASE = 722.5344 MHz, D_BAND = 10.6496 MHz)
 *   2. Loop  = F_cal / Fref                (conceptual, fractional)
 *   3. F_VCO = Fref * (Loop + DNUM/2^30)   = F_cal + Fref * DNUM / 2^30
 *   4. F_OUT = F_VCO / postDiv
 *
 * Audio PLL only supports bands 0 and 6; Video PLL supports bands 0-7.
 */
#define CGUANA_AVPLL_FBASE_HZ (722534400U) /* 722.5344 MHz */
#define CGUANA_AVPLL_DBAND_HZ (10649600U)  /* 10.6496  MHz */

static uint32_t CGUANA_GetAvPllFreq(
    volatile const uint32_t *pll1Reg, volatile const uint32_t *pll4Reg,
    volatile const uint32_t *dnumReg, bool isAudio)
{
    uint32_t pll1 = *pll1Reg;
    uint32_t band = (pll1 & CGUANA_CGUA_AUDIOPLL_PLL1_REG_AUDIOPLL_CCO_FREQ_BAND_SEL_MASK) >>
                    CGUANA_CGUA_AUDIOPLL_PLL1_REG_AUDIOPLL_CCO_FREQ_BAND_SEL_SHIFT;
    if (band > 7U || (isAudio && band != 0U && band != 6U))
    {
        return 0U;
    }

    uint32_t fref = s_cguanaRefFreq[
        (pll1 & CGUANA_CGUA_AUDIOPLL_PLL1_REG_AUDIOPLL_FREF_SET_MASK) >>
        CGUANA_CGUA_AUDIOPLL_PLL1_REG_AUDIOPLL_FREF_SET_SHIFT];
    uint32_t dnum = *dnumReg & CGUANA_CGUA_AUDIOPLL_DNUM_REG_AUDIOPLL_DNUM_MASK;
    uint32_t postdiv = (*pll4Reg & CGUANA_CGUA_AUDIOPLL_PLL4_REG_AUDIOPLL_POSTDIV_DIVRATIO_SEL_MASK) >>
                       CGUANA_CGUA_AUDIOPLL_PLL4_REG_AUDIOPLL_POSTDIV_DIVRATIO_SEL_SHIFT;
    if (postdiv < 8U)
    {
        return 0U;
    }

    uint32_t fcal = CGUANA_AVPLL_FBASE_HZ + band * CGUANA_AVPLL_DBAND_HZ;
    uint64_t fvco = (uint64_t)fcal + ((uint64_t)fref * dnum) / (1ULL << 30);
    return (uint32_t)(fvco / postdiv);
}

void CLOCK_InitAudioPll(const clock_cguana_avpll_config_t *config)
{
    assert(config != NULL);
    /* Enable reference clock output to Audio PLL */
    SYSCON__CGUANA->CGUA_CTRL_REG |= CGUANA_CGUA_CTRL_REG_CGUA_CLKGEN_CKREF_AUDIOPLL_EN_MASK;
    CGUANA_InitAvPll(
        &SYSCON__CGUANA->CGUA_AUDIOPLL_PLL1_REG,
        &SYSCON__CGUANA->CGUA_AUDIOPLL_PLL3_REG,
        &SYSCON__CGUANA->CGUA_AUDIOPLL_PLL4_REG,
        &SYSCON__CGUANA->CGUA_AUDIOPLL_DNUM_REG,
        &SYSCON__CGUANA->CGUA_AUDIOPLL_STS,
        config);
}

void CLOCK_DeinitAudioPll(void)
{
    CGUANA_DeinitAvPll(&SYSCON__CGUANA->CGUA_AUDIOPLL_PLL1_REG);
    SYSCON__CGUANA->CGUA_CTRL_REG &= ~CGUANA_CGUA_CTRL_REG_CGUA_CLKGEN_CKREF_AUDIOPLL_EN_MASK;
}

uint32_t CLOCK_GetAudioPllFreq(void)
{
    return CGUANA_GetAvPllFreq(
        &SYSCON__CGUANA->CGUA_AUDIOPLL_PLL1_REG,
        &SYSCON__CGUANA->CGUA_AUDIOPLL_PLL4_REG,
        &SYSCON__CGUANA->CGUA_AUDIOPLL_DNUM_REG,
        true);
}

void CLOCK_UpdateAudioPllDnum(uint32_t dnum)
{
    /* Write new DNUM value and assert UPDATE_REQ in the same write */
    SYSCON__CGUANA->CGUA_AUDIOPLL_DNUM_REG =
        CGUANA_CGUA_AUDIOPLL_DNUM_REG_AUDIOPLL_DNUM(dnum) |
        CGUANA_CGUA_AUDIOPLL_DNUM_REG_AUDIOPLL_DNUM_UPDATE_REQ_MASK;
    /* Wait for ACK (resynchronised) */
    while ((SYSCON__CGUANA->CGUAD_CTRL_STS &
            CGUANA_CGUAD_CTRL_STS_CGUAD_AUDIOPLL_DNUM_UPDATE_ACK_RESYNC_MASK) == 0U) {}
    /* Clear the UPDATE_REQ bit */
    SYSCON__CGUANA->CGUA_AUDIOPLL_DNUM_REG =
        CGUANA_CGUA_AUDIOPLL_DNUM_REG_AUDIOPLL_DNUM(dnum);
}

void CLOCK_InitVideoPll(const clock_cguana_avpll_config_t *config)
{
    assert(config != NULL);
    /* Enable reference clock output to Video PLL */
    SYSCON__CGUANA->CGUA_CTRL_REG |= CGUANA_CGUA_CTRL_REG_CGUA_CLKGEN_CKREF_VIDEOPLL_EN_MASK;
    /* Video PLL registers are identical in layout to Audio PLL -- cast to Audio-PLL volatile ptrs */
    CGUANA_InitAvPll(
        (volatile uint32_t *)&SYSCON__CGUANA->CGUA_VIDEOPLL_PLL1_REG,
        (volatile uint32_t *)&SYSCON__CGUANA->CGUA_VIDEOPLL_PLL3_REG,
        (volatile uint32_t *)&SYSCON__CGUANA->CGUA_VIDEOPLL_PLL4_REG,
        (volatile uint32_t *)&SYSCON__CGUANA->CGUA_VIDEOPLL_DNUM_REG,
        (volatile const uint32_t *)&SYSCON__CGUANA->CGUA_VIDEOPLL_STS,
        config);
}

void CLOCK_DeinitVideoPll(void)
{
    CGUANA_DeinitAvPll((volatile uint32_t *)&SYSCON__CGUANA->CGUA_VIDEOPLL_PLL1_REG);
    SYSCON__CGUANA->CGUA_CTRL_REG &= ~CGUANA_CGUA_CTRL_REG_CGUA_CLKGEN_CKREF_VIDEOPLL_EN_MASK;
}

