zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.c
uint32_t CLOCK_GetVideoPllFreq(void)
{
    return CGUANA_GetAvPllFreq(
        (volatile const uint32_t *)&SYSCON__CGUANA->CGUA_VIDEOPLL_PLL1_REG,
        (volatile const uint32_t *)&SYSCON__CGUANA->CGUA_VIDEOPLL_PLL4_REG,
        (volatile const uint32_t *)&SYSCON__CGUANA->CGUA_VIDEOPLL_DNUM_REG,
        false);
}

void CLOCK_UpdateVideoPllDnum(uint32_t dnum)
{
    SYSCON__CGUANA->CGUA_VIDEOPLL_DNUM_REG =
        CGUANA_CGUA_VIDEOPLL_DNUM_REG_VIDEOPLL_DNUM(dnum) |
        CGUANA_CGUA_VIDEOPLL_DNUM_REG_VIDEOPLL_DNUM_UPDATE_REQ_MASK;
    while ((SYSCON__CGUANA->CGUAD_CTRL_STS &
            CGUANA_CGUAD_CTRL_STS_CGUAD_VIDEOPLL_DNUM_UPDATE_ACK_RESYNC_MASK) == 0U) {}
    SYSCON__CGUANA->CGUA_VIDEOPLL_DNUM_REG =
        CGUANA_CGUA_VIDEOPLL_DNUM_REG_VIDEOPLL_DNUM(dnum);
}

bool CLOCK_EnableUsbFsClock(clock_usb_fs_src_t src)
{
    clock_root_config_t config = {0};
    const uint32_t targetFreq  = 48000000U;
    bool useUsbPhyPllClk       = false;
    uint32_t srcFreq;

    switch (src)
    {
        case kCLOCK_UsbFsSrcUsb1Root:
            srcFreq = CLOCK_GetRootClockFreq(kCLOCK_Root_CGU_USB1_ROOTCLK);
            break;
        case kCLOCK_UsbFsSrcUsbPllOut:
            srcFreq         = CLOCK_GetClockSrcFreq(kCLOCK_SRC_USBPLL_OUT);
            useUsbPhyPllClk = true;
            break;
        case kCLOCK_UsbFsSrcUsbPll48M:
            srcFreq         = CLOCK_GetClockSrcFreq(kCLOCK_SRC_USBPLL_48M);
            useUsbPhyPllClk = true;
            break;
        case kCLOCK_UsbFsSrcFro48M:
            srcFreq = CLOCK_GetClockSrcFreq(kCLOCK_SRC_FRO_48M);
            break;
        default:
            return false;
    }

    if ((srcFreq == 0U) || (srcFreq % targetFreq != 0U))
    {
        return false;
    }

    /* USBPLL_OUT/USBPLL_48M come from the shared USB PHY PLL. This also
     * ungates kCLOCK_COMM_usb0 internally. */
    if (useUsbPhyPllClk)
    {
        if (!CLOCK_EnableUsbPhyPllClock())
        {
            return false;
        }
    }

    config.clockShutdown = false;
    config.mux           = (uint8_t)src;
    config.div           = srcFreq / targetFreq;
    CLOCK_SetRootClock(kCLOCK_Root_COMM_usb1_fclk, &config);

    CLOCK_EnableClock(kCLOCK_COMM_usb1);

    RESET_PeripheralReset(kModCon_COMM_USB1);

    return true;
}

void CLOCK_DisableUsbFsClock(void)
{
    uint32_t mux = CLOCK_GetRootClockMux(kCLOCK_Root_COMM_usb1_fclk);

    if ((mux == kCLOCK_USB1_ClockRoot_USBPLL_OUT) || (mux == kCLOCK_USB1_ClockRoot_USBPLL_48M))
    {
        /* Also gates kCLOCK_COMM_usb0 internally. */
        CLOCK_DisableUsbPhyPllClock();
    }

    CLOCK_DisableClock(kCLOCK_COMM_usb1);

    CLOCK_PowerOffRootClock(kCLOCK_Root_COMM_usb1_fclk);
}

bool CLOCK_EnableUsbHsClock(void)
{
    clock_root_config_t config = {0};

    /* USB HS (EHCI) 48 MHz reference: usb0_fro48m root <- FRO48M, /1. */
    config.clockShutdown = false;
    config.mux           = (uint8_t)kCLOCK_USB0_FRO48M_ClockRoot_FRO48M;
    config.div           = 1U;
    CLOCK_SetRootClock(kCLOCK_Root_COMM_usb0_fro48m, &config);

    /* Power up the shared USB PHY PLL (480 MHz). NOTE: this also ungates
     * kCLOCK_COMM_usb0 internally. Propagate failure so the controller is not
     * released from reset on an unlocked PLL. */
    if (!CLOCK_EnableUsbPhyPllClock())
    {
        return false;
    }

    RESET_PeripheralReset(kModCon_COMM_USB0);

    /* Issue the controller-level soft reset (USBCMD.RST). */
    COMM__USBC->USBCMD |= USBHS_USBCMD_RST(1U);

    /* Wait out the mandatory reset-recovery time before the controller is used. */
    SDK_DelayAtLeastUs(15U, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);

    return true;
}

void CLOCK_DisableUsbHsClock(void)
{
    CLOCK_DisableUsbPhyPllClock();

    CLOCK_PowerOffRootClock(kCLOCK_Root_COMM_usb0_fro48m);
}

bool CLOCK_EnableUsbPhyPllClock(void)
{
    const uint32_t targetFreq = 480000000UL;
    uint32_t srcFreq;
    uint32_t phyPllDiv;

    /* PHY reference from usb0_phyclk root (SRC0 = SXOSC = 24 MHz). */
    srcFreq = CLOCK_GetRootClockFreq(kCLOCK_Root_COMM_usb0_phyclk);

    if ((srcFreq == 0U) || ((targetFreq % srcFreq) != 0UL))
    {
        return false;
    }

    switch (targetFreq / srcFreq)
    {
        case 15U:
            phyPllDiv = 0U;
            break;
        case 16U:
            phyPllDiv = 1U;
            break;
        case 20U:
            phyPllDiv = 2U;
            break;
        case 22U:
            phyPllDiv = 3U;
            break;
        case 24U:
            phyPllDiv = 4U;
            break;
        case 25U:
            phyPllDiv = 5U;
            break;
        case 30U:
            phyPllDiv = 6U;
            break;
        case 40U:
            phyPllDiv = 7U;
            break;
        default:
            return false;
    }

    /* Ungate the USB PHY (COMM usb0) so the PLL_SIC/CTRL registers are accessible. */
    CLOCK_EnableClock(kCLOCK_COMM_usb0);

    RESET_PeripheralReset(kModCon_COMM_USBPHY0);

    /* Release the PHY soft reset and enable the PLL regulator, then power the PLL. */
    COMM__USBPHY->CTRL_CLR    = USBPHY_CTRL_SFTRST(1U);
    COMM__USBPHY->PLL_SIC_SET = USBPHY_PLL_SIC_PLL_REG_ENABLE(1U);
    SDK_DelayAtLeastUs(15U, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
    COMM__USBPHY->PLL_SIC_SET = USBPHY_PLL_SIC_PLL_POWER(1U);

    /* Program the multiplier (PLL_DIV_SEL). */
    COMM__USBPHY->PLL_SIC_CLR = USBPHY_PLL_SIC_PLL_DIV_SEL_MASK;
    COMM__USBPHY->PLL_SIC_SET = USBPHY_PLL_SIC_PLL_DIV_SEL(phyPllDiv);

    /* Program the PLL post-divider that generates usbpll_out.
     * PLL_POSTDIV is a 3-bit field: a value of 0b0xx disables the post-divider
     * output (usbpll_out stays gated / has no clock), while 0b1xx enables it
     * and selects the divide ratio (0b100 = /1 ... 0b111 = /4). Writing 4U
     * (0b100) enables the post-divider at divide-by-1 so usbpll_out actually
     * produces a clock. Clear the field first, then set the new value. */
    COMM__USBPHY->PLL_SIC_CLR = USBPHY_PLL_SIC_PLL_POSTDIV_MASK;
    COMM__USBPHY->PLL_SIC_SET = USBPHY_PLL_SIC_PLL_POSTDIV(4U);

    /* Leave bypass, enable the USB clock taps (480 MHz / 48 MHz), ungate PHY clocks. */
    COMM__USBPHY->PLL_SIC_CLR = USBPHY_PLL_SIC_PLL_BYPASS(1U);
    COMM__USBPHY->PLL_SIC_SET = USBPHY_PLL_SIC_PLL_EN_USB_CLKS(1U);
    COMM__USBPHY->CTRL_CLR    = USBPHY_CTRL_CLR_CLKGATE(1U);

    /* Wait for the PLL to lock before it is used as a clock source. */
    while (USBPHY_PLL_SIC_PLL_LOCK(1U) != (COMM__USBPHY->PLL_SIC & USBPHY_PLL_SIC_PLL_LOCK_MASK))
    {
    }

