zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.c
    return true;
}

void CLOCK_DisableUsbPhyPllClock(void)
{
    /* Reverse of CLOCK_EnableUsbPhyPllClock: gate the PHY clocks, stop the USB
     * clock taps (480 MHz / 48 MHz), then power down the PLL and its regulator. */
    COMM__USBPHY->CTRL_SET    = USBPHY_CTRL_CLKGATE(1U);
    COMM__USBPHY->PLL_SIC_CLR = USBPHY_PLL_SIC_PLL_EN_USB_CLKS(1U);
    COMM__USBPHY->PLL_SIC_CLR = USBPHY_PLL_SIC_PLL_POWER(1U);
    COMM__USBPHY->PLL_SIC_CLR = USBPHY_PLL_SIC_PLL_REG_ENABLE(1U);

    CLOCK_DisableClock(kCLOCK_COMM_usb0);
}

/*! @brief One row of tuner (FLL) reference parameters for a given reference source.
 *
 * The values are transcribed literally from the reference manual FRO_TUNER settings
 * tables. ckrefSrcSel and sxoscFrefSel select the reference (CKREF_SOURCE_SEL and
 * SXOSC_FREF_SEL in CTRL_REG); frefWinLgth and cycleTarget are the reference window
 * length and expected FRO cycle count for that window (COUNT_REG); kiGain is the loop
 * integration gain (KI_GAIN in CTRL_REG). The cycle target is NOT derived at runtime
 * because it does not follow a single clean formula across all references. */
typedef struct _clock_fro_tuner_param
{
    uint16_t ckrefSrcSel;
    uint16_t sxoscFrefSel;
    uint16_t frefWinLgth;
    uint32_t cycleTarget;
    uint16_t kiGain;
} clock_fro_tuner_param_t;

/* FRO192M tuner settings (reference manual Table 814 FRO_192M FRO_TUNER settings).
 * Indexed by clock_fro_tuner_src_t. */
static const clock_fro_tuner_param_t s_froTuner192mParam[] = {
    /* {ckrefSrcSel, sxoscFrefSel, frefWinLgth, cycleTarget, kiGain} */
    [kCLOCK_FroTunerRefSxosc19M2]   = {0U, 0U, 480U, 4800U, 3U},
    [kCLOCK_FroTunerRefSxosc24M]    = {0U, 1U, 600U, 4800U, 3U},
    [kCLOCK_FroTunerRefSxosc32M]    = {0U, 2U, 800U, 4800U, 3U},
    [kCLOCK_FroTunerRefSxosc40M]    = {0U, 3U, 1000U, 4800U, 3U},
    /* SXOSC_FREF_SEL is not applicable for the non-SXOSC references (blank in the
     * datasheet); it only matters when CKREF_SOURCE_SEL is 0, so leave it 0. */
    [kCLOCK_FroTunerRefSxosc32768Hz] = {1U, 0U, 1U, 5859U, 4U},
    [kCLOCK_FroTunerRefUsbFsSof1kHz] = {2U, 0U, 1U, 192000U, 9U},
    [kCLOCK_FroTunerRefUsbHsSof8kHz] = {3U, 0U, 1U, 24000U, 6U},
};

/* FRO12M tuner settings (reference manual Table 815 FRO_12M FRO_TUNER settings).
 * Indexed by clock_fro_tuner_src_t. */
static const clock_fro_tuner_param_t s_froTuner12mParam[] = {
    /* {ckrefSrcSel, sxoscFrefSel, frefWinLgth, cycleTarget, kiGain} */
    [kCLOCK_FroTunerRefSxosc19M2]     = {0U, 0U, 7680U, 4800U, 3U},
    [kCLOCK_FroTunerRefSxosc24M]      = {0U, 1U, 9600U, 4800U, 3U},
    [kCLOCK_FroTunerRefSxosc32M]      = {0U, 2U, 12800U, 4800U, 3U},
    [kCLOCK_FroTunerRefSxosc40M]      = {0U, 3U, 16000U, 4800U, 3U},
    [kCLOCK_FroTunerRefSxosc32768Hz]  = {1U, 0U, 14U, 5126U, 4U},
    [kCLOCK_FroTunerRefUsbFsSof1kHz]  = {2U, 0U, 1U, 12000U, 5U},
    [kCLOCK_FroTunerRefUsbHsSof8kHz]  = {3U, 0U, 4U, 600U, 4U},
};

void CLOCK_EnableFroTuner(clock_fro_tuner_target_t target, clock_fro_tuner_src_t src, uint16_t lockCriteria)
{
    const clock_fro_tuner_param_t *param;
    uint32_t clearMask;
    uint32_t setBits;

    if ((uint32_t)src >= ARRAY_SIZE(s_froTuner192mParam))
    {
        return;
    }

    /* Note: CKREF_SOURCE_SEL and SXOSC_FREF_SEL are shared by both tuners, so the
     * FRO12M and FRO192M tuners can only lock to the same reference source at once.
     * Enabling one tuner reprograms the reference-source selection for both.
     * SXOSC_FREF_SEL only applies when CKREF_SOURCE_SEL == 0 (SXOSC reference); for
     * any other reference it is left untouched so a concurrent SXOSC tuner setting
     * is not disturbed. */
    if (target == kCLOCK_FroTuner12M)
    {
        param = &s_froTuner12mParam[src];

        /* Program the control fields in one read-modify-write, keeping TUNE_EN cleared
         * until the count register is set. */
        clearMask = CGUANA_CGUAD_FROTUNER_CTRL_REG_CGUAD_FROTUNER_FRO12M_LOCK_CRITERIA_MASK |
                    CGUANA_CGUAD_FROTUNER_CTRL_REG_CGUAD_FROTUNER_FRO12M_KI_GAIN_MASK |
                    CGUANA_CGUAD_FROTUNER_CTRL_REG_CGUAD_FROTUNER_CKREF_SOURCE_SEL_MASK |
                    CGUANA_CGUAD_FROTUNER_CTRL_REG_CGUAD_FROTUNER_FRO12M_TUNE_EN_MASK;
        setBits = CGUANA_CGUAD_FROTUNER_CTRL_REG_CGUAD_FROTUNER_FRO12M_LOCK_CRITERIA(lockCriteria) |
                  CGUANA_CGUAD_FROTUNER_CTRL_REG_CGUAD_FROTUNER_FRO12M_KI_GAIN(param->kiGain) |
                  CGUANA_CGUAD_FROTUNER_CTRL_REG_CGUAD_FROTUNER_CKREF_SOURCE_SEL(param->ckrefSrcSel);

        /* Only configure SXOSC_FREF_SEL when the reference is SXOSC. */
        if (param->ckrefSrcSel == 0U)
        {
            clearMask |= CGUANA_CGUAD_FROTUNER_CTRL_REG_CGUAD_FROTUNER_SXOSC_FREF_SEL_MASK;
            setBits |= CGUANA_CGUAD_FROTUNER_CTRL_REG_CGUAD_FROTUNER_SXOSC_FREF_SEL(param->sxoscFrefSel);
        }

        SYSCON__CGUANA->CGUAD_FROTUNER_CTRL_REG =
            (SYSCON__CGUANA->CGUAD_FROTUNER_CTRL_REG & ~clearMask) | setBits;

        /* Program the cycle target and reference window length in one read-modify-write. */
        SYSCON__CGUANA->CGUAD_FROTUNER_FRO12M_COUNT_REG =
            (SYSCON__CGUANA->CGUAD_FROTUNER_FRO12M_COUNT_REG &
             ~(CGUANA_CGUAD_FROTUNER_FRO12M_COUNT_REG_CGUAD_FROTUNER_FRO12M_CYCLE_TARGET_MASK |
               CGUANA_CGUAD_FROTUNER_FRO12M_COUNT_REG_CGUAD_FROTUNER_FRO12M_FREF_WIN_LGTH_MASK)) |
            CGUANA_CGUAD_FROTUNER_FRO12M_COUNT_REG_CGUAD_FROTUNER_FRO12M_CYCLE_TARGET(param->cycleTarget) |
            CGUANA_CGUAD_FROTUNER_FRO12M_COUNT_REG_CGUAD_FROTUNER_FRO12M_FREF_WIN_LGTH(param->frefWinLgth);

        /* Enable the FRO12M tuner last, once its configuration is in place. */
        SYSCON__CGUANA->CGUAD_FROTUNER_CTRL_REG |= CGUANA_CGUAD_FROTUNER_CTRL_REG_CGUAD_FROTUNER_FRO12M_TUNE_EN(1U);
    }
    else
    {
        param = &s_froTuner192mParam[src];

        /* Program the control fields in one read-modify-write, keeping TUNE_EN cleared
         * until the count register is set. */
        clearMask = CGUANA_CGUAD_FROTUNER_CTRL_REG_CGUAD_FROTUNER_FRO192M_LOCK_CRITERIA_MASK |
                    CGUANA_CGUAD_FROTUNER_CTRL_REG_CGUAD_FROTUNER_FRO192M_KI_GAIN_MASK |
                    CGUANA_CGUAD_FROTUNER_CTRL_REG_CGUAD_FROTUNER_CKREF_SOURCE_SEL_MASK |
                    CGUANA_CGUAD_FROTUNER_CTRL_REG_CGUAD_FROTUNER_FRO192M_TUNE_EN_MASK;
        setBits = CGUANA_CGUAD_FROTUNER_CTRL_REG_CGUAD_FROTUNER_FRO192M_LOCK_CRITERIA(lockCriteria) |
                  CGUANA_CGUAD_FROTUNER_CTRL_REG_CGUAD_FROTUNER_FRO192M_KI_GAIN(param->kiGain) |
                  CGUANA_CGUAD_FROTUNER_CTRL_REG_CGUAD_FROTUNER_CKREF_SOURCE_SEL(param->ckrefSrcSel);

