zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.c
        /* Only configure SXOSC_FREF_SEL when the reference is SXOSC. */
        if (param->ckrefSrcSel == 0U)
        {
            clearMask |= CGUANA_CGUAD_FROTUNER_CTRL_REG_CGUAD_FROTUNER_SXOSC_FREF_SEL_MASK;
            setBits |= CGUANA_CGUAD_FROTUNER_CTRL_REG_CGUAD_FROTUNER_SXOSC_FREF_SEL(param->sxoscFrefSel);
        }

        SYSCON__CGUANA->CGUAD_FROTUNER_CTRL_REG =
            (SYSCON__CGUANA->CGUAD_FROTUNER_CTRL_REG & ~clearMask) | setBits;

        /* Program the cycle target and reference window length in one read-modify-write. */
        SYSCON__CGUANA->CGUAD_FROTUNER_FRO192M_COUNT_REG =
            (SYSCON__CGUANA->CGUAD_FROTUNER_FRO192M_COUNT_REG &
             ~(CGUANA_CGUAD_FROTUNER_FRO192M_COUNT_REG_CGUAD_FROTUNER_FRO192M_CYCLE_TARGET_MASK |
               CGUANA_CGUAD_FROTUNER_FRO192M_COUNT_REG_CGUAD_FROTUNER_FRO192M_FREF_WIN_LGTH_MASK)) |
            CGUANA_CGUAD_FROTUNER_FRO192M_COUNT_REG_CGUAD_FROTUNER_FRO192M_CYCLE_TARGET(param->cycleTarget) |
            CGUANA_CGUAD_FROTUNER_FRO192M_COUNT_REG_CGUAD_FROTUNER_FRO192M_FREF_WIN_LGTH(param->frefWinLgth);

        /* Enable the FRO192M tuner last, once its configuration is in place. */
        SYSCON__CGUANA->CGUAD_FROTUNER_CTRL_REG |= CGUANA_CGUAD_FROTUNER_CTRL_REG_CGUAD_FROTUNER_FRO192M_TUNE_EN(1U);
    }
}

void CLOCK_DisableFroTuner(clock_fro_tuner_target_t target)
{
    /* Clear TUNE_EN only; leave the other tuner configuration fields intact so the
     * FRO keeps its last tuned value and can be re-enabled as-is. */
    if (target == kCLOCK_FroTuner12M)
    {
        SYSCON__CGUANA->CGUAD_FROTUNER_CTRL_REG &= ~CGUANA_CGUAD_FROTUNER_CTRL_REG_CGUAD_FROTUNER_FRO12M_TUNE_EN_MASK;
    }
    else
    {
        SYSCON__CGUANA->CGUAD_FROTUNER_CTRL_REG &= ~CGUANA_CGUAD_FROTUNER_CTRL_REG_CGUAD_FROTUNER_FRO192M_TUNE_EN_MASK;
    }
}

/*******************************************************************************
 * Frequency resolver (MCUX-88602)
 *
 * Mental model:
 *   For any clock root we read mux + div + sndDiv from CCM SLICE_CONTROL/STATUS0,
 *   resolve the mux to a clock_name_t via CLOCK_GetRootClockSource(), then ask
 *   CLOCK_GetClockSrcFreq() for the source frequency. A clock_name_t source
 *   has four shapes:
 *     1. It aliases another clock root (L1 Ox / L2 Ox / Lx WAKE feedback)
 *        - look it up in s_clockSrcRootMap and recurse via CLOCK_GetRootClockFreq.
 *     2. It is a relatively fixed analog source (Sx / Ax / Dx)
 *        - simple: return a constant or #ifndef-guarded macro
 *        - complex: call a PLL helper (Core/Main/Sys/Audio/Video).
 *     3. It is a MODCON-controlled Mx (parent root /1 or /2)
 *        - look up the parent root in s_clockSrcRootMap, recurse, then divide
 *          by the MODCON-driven /2 bit.
 *     4. Special: both kCLOCK_SRC_MAIN and kCLOCK_SRC_CPU -> kCLOCK_Root_CGU_MAIN_ROOTCLK.
 *        CGU ROOT 30 feeds CMPT ROOT 0 MAIN after div + sndDiv, and CMPT ROOT 1 CPU after
 *        div only. CLOCK_GetRootClockFreq applies both dividers, so kCLOCK_SRC_CPU needs to
 *        multiply the resolved frequency by sndDiv to recover the post-div-only value
 *        (see MCUX-88628).
 *
 * Final frequency: srcFreq / div / sndDiv. ISR-safe and reentrant.
 *
 * Termination: CLOCK_GetRootClockFreq and CLOCK_GetClockSrcFreq are mutually
 * recursive. The recursion graph is the hardware mux DAG (rooted at L0 analog
 * sources) plus a few well-defined fixed-frequency Sx sources that short the
 * back-edges in the source-name tables (SXOSC, LP12M_WAKE, LP1M_WAKE are
 * resolved as constants, not via their nominal CGU/WAKE roots, which would
 * cycle back through OSC_24M MODCON SEL / their own root mux SRC). Max chain
 * is ~4 hops (L2 root -> L1 root -> L0 source -> Case 2 constant).
 ******************************************************************************/

/*
 * Weak default board hook for external (Dx) sources (REQ-005).
 * Board ports override by linking a non-weak symbol of the same name.
 */
__attribute__((weak)) uint32_t CLOCK_GetExternalSrcFreq(clock_name_t name)
{
    (void)name;
    return 0U;
}

/*
 * src -> root flat lookup table. Indexed directly by clock_name_t for any
 * value in the [0, kCLOCK_SRC_BOUNDARY) range. Slots [48, 64) are reserved
 * future-in-map slots and hold kCLOCK_Root_Invalid; the resolver short-
 * circuits to 0 if any of those values shows up at runtime. Adding a new
 * in-map src means picking the next free value in the reserved segment and
 * adding its [slot] = root line below -- no other entries move.
 *
 * The six Mx MODCON-controlled /2 entries (kCLOCK_SRC_*_DIV2 / *PFDX_DIV2)
 * recurse normally; the /2 selection is read in CLOCK_GetClockSrcFreq via a
 * canonical MODCON instance for each Mx. The SW invariant is that all
 * consumers of the same Mx source program identical /2 selections system-wide.
 *
 * Cycle breakers intentionally absent from the table -- their CGU/WAKE roots'
 * mux SRCs name those same sources back, forming cycles. Treated as Case 2
 * fixed-frequency constants:
 *   kCLOCK_SRC_SXOSC       (O0 -- OSC_24M MODCON SEL=1 routes back to SXOSC)
 *   kCLOCK_SRC_LP12M_WAKE  (WAKE root 3 wake_lp12m SRC0 == LP12M_WAKE)
 *   kCLOCK_SRC_LP1M_WAKE   (WAKE root 2 wake_lp1m  SRC0 == LP1M_WAKE)
 *
 * Case 4 special: both kCLOCK_SRC_MAIN and kCLOCK_SRC_CPU alias
 * kCLOCK_Root_CGU_MAIN_ROOTCLK (CGU root 30, renamed for MCUX-88628). The two
 * differ by where they tap on the slice: MAIN is post-div+sndDiv, CPU is post-div
 * only. The /sndDiv backout for CPU lives in CLOCK_GetClockSrcFreq below.
 */
static const clock_root_t s_clockSrcRootMap[kCLOCK_SRC_BOUNDARY] = {
    /* --- A.1: L1 Ox CGU passthrough/mux outputs (38) --- */
    [kCLOCK_SRC_BASE]              = kCLOCK_Root_CGU_BASE_CLK,
    [kCLOCK_SRC_LOW]               = kCLOCK_Root_CGU_LOW_CLK,
    [kCLOCK_SRC_MAINPLL_DIVX]      = kCLOCK_Root_CGU_MAINPLL_DIVX,
    [kCLOCK_SRC_SYSPLL_DIVX]       = kCLOCK_Root_CGU_SYSPLL_DIVX,
    [kCLOCK_SRC_PLL_PFDX]          = kCLOCK_Root_CGU_PLL_PFDX,
    [kCLOCK_SRC_MEDIA_PFDX]        = kCLOCK_Root_CGU_MEDIA_PFDX,
    [kCLOCK_SRC_MAINDIVX]          = kCLOCK_Root_CGU_MAINDIVX_ROOTCLK,
    [kCLOCK_SRC_SAIMCLK]           = kCLOCK_Root_CGU_SAIMCLK_ROOTCLK,
    [kCLOCK_SRC_SAIMCLK0]          = kCLOCK_Root_CGU_SAIMCLK0_ROOTCLK,
    [kCLOCK_SRC_SAIMCLK1]          = kCLOCK_Root_CGU_SAIMCLK1_ROOTCLK,
    [kCLOCK_SRC_SAIMCLK2]          = kCLOCK_Root_CGU_SAIMCLK2_ROOTCLK,
    [kCLOCK_SRC_ULP32K]            = kCLOCK_Root_CGU_ULP32K_ROOTCLK,
    [kCLOCK_SRC_FRO192M]           = kCLOCK_Root_CGU_FRO192M_ROOTCLK,
    [kCLOCK_SRC_FRO96M]            = kCLOCK_Root_CGU_FRO96M_ROOTCLK,
    [kCLOCK_SRC_FRO48M]            = kCLOCK_Root_CGU_FRO48M_ROOTCLK,
    [kCLOCK_SRC_FRO24M]            = kCLOCK_Root_CGU_FRO24M_ROOTCLK,
    [kCLOCK_SRC_SYSPLLDIV4]        = kCLOCK_Root_CGU_SYSPLLDIV4_ROOTCLK,
    [kCLOCK_SRC_SYSPLLDIV5]        = kCLOCK_Root_CGU_SYSPLLDIV5_ROOTCLK,
    [kCLOCK_SRC_MAINPLLDIV8]       = kCLOCK_Root_CGU_MAINPLLDIV8_ROOTCLK,
    [kCLOCK_SRC_MAINPLLDIV10]      = kCLOCK_Root_CGU_MAINPLLDIV10_ROOTCLK,
    [kCLOCK_SRC_AUDIOPLL]          = kCLOCK_Root_CGU_AUDIOPLL_ROOTCLK,
    [kCLOCK_SRC_VIDEOPLL]          = kCLOCK_Root_CGU_VIDEOPLL_ROOTCLK,
    [kCLOCK_SRC_CPU]               = kCLOCK_Root_CGU_MAIN_ROOTCLK,
    [kCLOCK_SRC_NPU]               = kCLOCK_Root_CGU_NPU_ROOTCLK,
    [kCLOCK_SRC_MEDIABUS]          = kCLOCK_Root_CGU_MEDIABUS_ROOTCLK,
    [kCLOCK_SRC_AUDIOBUS]          = kCLOCK_Root_CGU_AUDIOBUS_ROOTCLK,
    [kCLOCK_SRC_COMMBUS]           = kCLOCK_Root_CGU_COMMBUS_ROOTCLK,
    [kCLOCK_SRC_WAKEBUS]           = kCLOCK_Root_CGU_WAKEBUS_ROOTCLK,
    [kCLOCK_SRC_PERI0]             = kCLOCK_Root_CGU_PERI_ROOTCLK0,
    [kCLOCK_SRC_PERI1]             = kCLOCK_Root_CGU_PERI_ROOTCLK1,
    [kCLOCK_SRC_PERI2]             = kCLOCK_Root_CGU_PERI_ROOTCLK2,
    [kCLOCK_SRC_PERI3]             = kCLOCK_Root_CGU_PERI_ROOTCLK3,
    [kCLOCK_SRC_PERI4]             = kCLOCK_Root_CGU_PERI_ROOTCLK4,
    [kCLOCK_SRC_PERI5]             = kCLOCK_Root_CGU_PERI_ROOTCLK5,
    [kCLOCK_SRC_PERI6]             = kCLOCK_Root_CGU_PERI_ROOTCLK6,
    [kCLOCK_SRC_PERI7]             = kCLOCK_Root_CGU_PERI_ROOTCLK7,
    [kCLOCK_SRC_AUDIO]             = kCLOCK_Root_CGU_AUDIO_ROOTCLK,
    [kCLOCK_SRC_VIDEO]             = kCLOCK_Root_CGU_VIDEO_ROOTCLK,
    [kCLOCK_SRC_USB1]              = kCLOCK_Root_CGU_USB1_ROOTCLK,
    [kCLOCK_SRC_ETH]               = kCLOCK_Root_CGU_ETH_ROOTCLK,

    /* --- A.2: Case 4 special alias (1) --- */
    [kCLOCK_SRC_MAIN]              = kCLOCK_Root_CGU_MAIN_ROOTCLK,

    /* --- A.3: L2 Lx WAKE-domain feedback (1) --- */
    [kCLOCK_SRC_WAKE_LPCLK]        = kCLOCK_Root_WAKE_wake_lpclk,

    /* --- A.4: Mx MODCON-controlled /2 (6) ---
     * Parent root only; the /2 is applied in CLOCK_GetClockSrcFreq. */
    [kCLOCK_SRC_MAIN_PERI0_DIV2]   = kCLOCK_Root_CGU_PERI_ROOTCLK0,
    [kCLOCK_SRC_MAIN_PERI1_DIV2]   = kCLOCK_Root_CGU_PERI_ROOTCLK1,
    [kCLOCK_SRC_MAINPFDX_DIV2]     = kCLOCK_Root_CGU_MAINPFDX_ROOTCLK,
    [kCLOCK_SRC_COMM_PERI1_DIV2]   = kCLOCK_Root_CGU_PERI_ROOTCLK1,
    [kCLOCK_SRC_COMM_PERI2_DIV2]   = kCLOCK_Root_CGU_PERI_ROOTCLK2,
    [kCLOCK_SRC_COMMPFDX_DIV2]     = kCLOCK_Root_CGU_COMMPFDX_ROOTCLK,

    /* --- Section B: reserved future-in-map slots [48, 64) ---
     * Explicitly marked kCLOCK_Root_Invalid so the resolver can short-circuit
     * to 0. (Designated-init zero-fill would default to root 0 = SXOSC, which
     * is a valid root, not what we want.) */
    [48] = kCLOCK_Root_Invalid, [49] = kCLOCK_Root_Invalid,
    [50] = kCLOCK_Root_Invalid, [51] = kCLOCK_Root_Invalid,
    [52] = kCLOCK_Root_Invalid, [53] = kCLOCK_Root_Invalid,
    [54] = kCLOCK_Root_Invalid, [55] = kCLOCK_Root_Invalid,
    [56] = kCLOCK_Root_Invalid, [57] = kCLOCK_Root_Invalid,
    [58] = kCLOCK_Root_Invalid, [59] = kCLOCK_Root_Invalid,
    [60] = kCLOCK_Root_Invalid, [61] = kCLOCK_Root_Invalid,
    [62] = kCLOCK_Root_Invalid, [63] = kCLOCK_Root_Invalid,
};

