zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.c
/*
 * Read the configured second divider for a root (CCM STATUS0.SND_DIV + 1).
 * Mirrors the convention of CLOCK_GetRootClockDiv: returns the 1-based value.
 */
static uint32_t CLOCK_GetRootClockSndDiv(clock_root_t root)
{
    CCM_Type *targetCCM;
    uint32_t  index;
    targetCCM = locateClkRoot(root, &index);
    if (NULL == targetCCM) { return 0U; }
    return ((targetCCM->CLOCK_ROOT[index].STATUS0 & CCM_STATUS0_SND_DIV_MASK) >> CCM_STATUS0_SND_DIV_SHIFT) + 1UL;
}

/*
 * CLOCK_GetClockSrcFreq -- resolve a clock_name_t source to its frequency.
 *
 * Cases 1/3/4: name < kCLOCK_SRC_BOUNDARY -> O(1) direct-index into
 *              s_clockSrcRootMap, recurse into the root via
 *              CLOCK_GetRootClockFreq. Six Mx sources (case 3) then apply
 *              an additional MODCON-controlled /2 -- handled as a special
 *              case below the table lookup so the table itself stays simple.
 * Case 2:      name >= kCLOCK_SRC_BOUNDARY -> terminal: a fixed analog
 *              (Sx/Ax/Dx), PLL helper, macro, or external hook.
 */
uint32_t CLOCK_GetClockSrcFreq(clock_name_t name)
{
    uint32_t freq;

    /* Cases 1, 3, 4 -- direct index into the src->root table. */
    if ((uint32_t)name < (uint32_t)kCLOCK_SRC_BOUNDARY)
    {
        clock_root_t root = s_clockSrcRootMap[name];
        if (root == kCLOCK_Root_Invalid)
        {
            /* Hit a reserved (Section B) slot. */
            return 0U;
        }
        freq = CLOCK_GetRootClockFreq(root);

        /* Case 3 -- the six Mx sources additionally /2 per MODCON. Skip
         * the MODCON read entirely for Cases 1/4 via the contiguous-block
         * range check (the six Mx entries are contiguous in clock_name_t). */
        if (((uint32_t)name >= (uint32_t)kCLOCK_SRC_MAIN_PERI0_DIV2) &&
            ((uint32_t)name <= (uint32_t)kCLOCK_SRC_COMMPFDX_DIV2) &&
            CLOCK_GetClockSrcDiv2(name))
        {
            freq /= 2U;
        }

        /* Case 4 -- kCLOCK_SRC_CPU taps CGU ROOT 30 after the first divider
         * only, while CLOCK_GetRootClockFreq applied both div and sndDiv.
         * Multiply by sndDiv to recover the post-div-only frequency. MAIN
         * keeps the post-both-dividers value the table lookup produced. */
        if (name == kCLOCK_SRC_CPU)
        {
            freq *= CLOCK_GetRootClockSndDiv(kCLOCK_Root_CGU_MAIN_ROOTCLK);
        }
        return freq;
    }

    /* Case 2 -- analog (Sx/Ax) or external (Dx). Only L0 fundamentals appear
     * here; no-underscore FRO aliases are routed through the table above. */
    switch (name)
    {
        /* OSC_24M (Sx) -- MODCON-controlled between FRO_24M and SXOSC. */
        case kCLOCK_SRC_OSC_24M:
            return CLOCK_GetClockSrcFreq(
                (CLOCK_GetOsc24mSource() == kCLOCK_Osc24mSrc_FRO_24M) ? kCLOCK_SRC_FRO_24M
                                                                     : kCLOCK_SRC_SXOSC);

        /* Sx -- L0 fixed analog constants.
         * SXOSC, LP12M_WAKE, LP1M_WAKE are here (not in the table) to break
         * back-edges in the source-name graph -- see the table's NOTE comments. */
        case kCLOCK_SRC_SXOSC:
            return 24000000U;
        case kCLOCK_SRC_FRO_192M:
            return 192000000U;
        case kCLOCK_SRC_FRO_96M:
            return 96000000U;
        case kCLOCK_SRC_FRO_48M:
            return 48000000U;
        case kCLOCK_SRC_FRO_24M:
            return 24000000U;
        case kCLOCK_SRC_LP12M_WAKE:
        case kCLOCK_SRC_LPOSC_12M_CORE:
            return 12000000U;
        case kCLOCK_SRC_LP1M_WAKE:
        case kCLOCK_SRC_LPOSC_1M_CORE:
        case kCLOCK_SRC_LP1M_CORE:
            return 1000000U;
        case kCLOCK_SRC_LP2M_WAKE:
            return 2000000U;
        case kCLOCK_SRC_LPOSC32K:
            return 32768U;

        /* Sx -- PLL-derived: dedicated helpers.
         * Integer dividers (DIV4/5/8/10/20) are simply VCO/N at the call site;
         * fractional outputs (DIVOUT0..2) are the public PLL accessor. */
        case kCLOCK_SRC_COREPLL_OUT:
            return CLOCK_GetCorePllFreq();
        case kCLOCK_SRC_AUDIOPLL_DIVOUT:
            return CLOCK_GetAudioPllFreq();
        case kCLOCK_SRC_VIDEOPLL_DIVOUT:
            return CLOCK_GetVideoPllFreq();
        case kCLOCK_SRC_MAINPLL_DIV4:
            return CLOCK_GetMainPllVcoFreq() / 4U;
        case kCLOCK_SRC_MAINPLL_DIV5:
            return CLOCK_GetMainPllVcoFreq() / 5U;
        case kCLOCK_SRC_MAINPLL_DIV8:
            return CLOCK_GetMainPllVcoFreq() / 8U;
        case kCLOCK_SRC_MAINPLL_DIV10:
            return CLOCK_GetMainPllVcoFreq() / 10U;
        case kCLOCK_SRC_MAINPLL_DIV20:
            return CLOCK_GetMainPllVcoFreq() / 20U;
        case kCLOCK_SRC_MAINPLL_DIVOUT0:
            return CLOCK_GetMainPllFreq(0U);
        case kCLOCK_SRC_MAINPLL_DIVOUT1:
            return CLOCK_GetMainPllFreq(1U);
        case kCLOCK_SRC_MAINPLL_DIVOUT2:
            return CLOCK_GetMainPllFreq(2U);
        case kCLOCK_SRC_SYSPLL_DIV4:
            return CLOCK_GetSysPllVcoFreq() / 4U;
        case kCLOCK_SRC_SYSPLL_DIV5:
            return CLOCK_GetSysPllVcoFreq() / 5U;
        case kCLOCK_SRC_SYSPLL_DIV10:
            return CLOCK_GetSysPllVcoFreq() / 10U;
        case kCLOCK_SRC_SYSPLL_DIV20:
            return CLOCK_GetSysPllVcoFreq() / 20U;
        case kCLOCK_SRC_SYSPLL_DIVOUT0:
            return CLOCK_GetSysPllFreq(0U);
        case kCLOCK_SRC_SYSPLL_DIVOUT1:
            return CLOCK_GetSysPllFreq(1U);
        case kCLOCK_SRC_SYSPLL_DIVOUT2:
            return CLOCK_GetSysPllFreq(2U);

        /* Macro-backed PLL defaults (REQ-010); board/app overrides via #ifndef. */
        case kCLOCK_SRC_USBPLL_OUT:
            return FSL_CLOCK_USBPLL_OUT_FREQ_HZ;
        case kCLOCK_SRC_USBPLL_48M:
            return FSL_CLOCK_USBPLL_48M_FREQ_HZ;
        case kCLOCK_SRC_MIPIPLL_DIV8:
            return FSL_CLOCK_MIPIPLL_DIV8_FREQ_HZ;
        case kCLOCK_SRC_MEDIAPLL:
            return FSL_CLOCK_MEDIAPLL_FREQ_HZ;

        /* Dx -- external sources via board hook (REQ-005). */
        case kCLOCK_SRC_SAI0_MCLK:
        case kCLOCK_SRC_SAI1_MCLK:
        case kCLOCK_SRC_SAI2_MCLK:
            return CLOCK_GetExternalSrcFreq(name);

        case kCLOCK_SRC_TIE_LOW:
        case kCLOCK_SRC_Invalid:
        default:
            return 0U;
    }
}

uint32_t CLOCK_GetRootClockFreq(clock_root_t root)
{
    uint32_t      mux;
    uint32_t      div;
    uint32_t      sndDiv;
    uint32_t      srcFreq;
    clock_name_t  src;

    mux    = CLOCK_GetRootClockMux(root);
    src    = CLOCK_GetRootClockSource(root, mux);
    div    = CLOCK_GetRootClockDiv(root);
    sndDiv = CLOCK_GetRootClockSndDiv(root);

    if ((div == 0U) || (sndDiv == 0U) || (src == kCLOCK_SRC_Invalid))
    {
        return 0U;
    }

    srcFreq = CLOCK_GetClockSrcFreq(src);
    return (srcFreq / div) / sndDiv;
}

