zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.c
/*******************************************************************************
 * FREQME-based actual frequency measurement
 *
 * CLOCK_MeasureRootClockFreq / CLOCK_MeasureClockSrcFreq return the real,
 * hardware-measured frequency instead of the theoretical value the Get APIs
 * compute -- needed while the internal FROs are untrimmed. Register-level
 * FREQME/INPUTMUX access on purpose: the fsl_freqme/fsl_inputmux drivers call
 * back into this driver for clock gating, so using them here would create a
 * circular dependency and force every project to link both drivers.
 *
 * Measurement chain: every subsystem's FREQME measures its own targets, with
 * a per-domain reference whose frequency is trusted or itself measured:
 *   SYSCON, WAKE : reference = SXOSC crystal (the only trusted clock).
 *   others       : reference = a domain input that is node-identical to a
 *                  SYSCON target tap, pre-measured against SXOSC by the
 *                  SYSCON FREQME. Accuracy therefore always derives from the
 *                  crystal; no divider arithmetic is involved anywhere.
 ******************************************************************************/

/* Chip-wide measurement bounds: reference clocks are >= 24 MHz and no clock
 * exceeds 2 GHz, so the count ratio is bounded by 2 GHz / 24 MHz < 84. At
 * scale 24 the worst-case RESULT is 84 * 2^24 ~= 1.41e9 < 2^31 - 1: the
 * 31-bit result counter cannot overflow for any valid scale. */
#define CLOCK_FREQME_SCALE_MAX    (24U)
#define CLOCK_FREQME_MAX_RATIO    (84UL)
#define CLOCK_FREQME_MIN_EXPECTED (0xFUL)

#if (FSL_CLOCK_FREQME_REF_SCALE > 24U)
#error "FSL_CLOCK_FREQME_REF_SCALE must be in range 0..24 (the 31-bit result counter overflows above 24)."
#endif

/* Marker values for the descriptor/mapping tables below. */
#define CLOCK_FREQME_REF_IS_SXOSC (0xFFU) /* reference is the crystal; no pre-measurement */
#define CLOCK_FREQME_TAR_NONE     (0xFFU) /* root has no FREQME target tap */

/* Per-domain FREQME resources (the domain table itself lives in
 * CLOCK_FreqmeMeasure, its only user). refMux selects the domain reference on
 * the FREQMEAS REF mux; sysconTarRef is the SYSCON FREQMEAS TAR value tapping
 * the node-identical signal used to pre-measure that reference (mux values
 * match fsl_inputmux_connections.h). refRoot names the reference's root for
 * the crystal-referenced domains. */
typedef struct
{
    FREQME_Type   *freqme;
    INPUTMUX_Type *inputmux;
    clock_lpcg_t   gate;         /* one LPCG covers the domain FREQME + INPUTMUX */
    uint8_t        refMux;
    uint8_t        sysconTarRef;
    clock_root_t   refRoot;      /* used only when sysconTarRef == CLOCK_FREQME_REF_IS_SXOSC */
} clock_freqme_domain_t;

enum
{
    kCLOCK_FreqmeDomainSyscon = 0,
    kCLOCK_FreqmeDomainCmpt,
    kCLOCK_FreqmeDomainMain,
    kCLOCK_FreqmeDomainWake,
    kCLOCK_FreqmeDomainComm,
    kCLOCK_FreqmeDomainAudio,
    kCLOCK_FreqmeDomainMedia,
};

/* root -> domain FREQMEAS TAR mux value, one table per subsystem range,
 * indexed by (root - kCLOCK_Root_<SS>_START). Values transcribed from
 * fsl_inputmux_connections.h; CLOCK_FREQME_TAR_NONE marks roots without a
 * target tap. The CGU range is formulaic and handled in code (see
 * CLOCK_LocateFreqmeTar).
 *
 * Note: each domain's FREQMEAS mux also has inputs (typically below 16) that
 * are NOT clock-tree roots and therefore have no entry in these tables: XBAR
 * event outputs (hsp_ss_xbar0_out*) and silicon test/monitor signals such as
 * the pm_104* process-monitor ring oscillators (LVT/SLVT speed-grade and
 * HTOL aging monitors), the WAKE buck/lposc test buses, and the COMM usbphy
 * test clocks. Those signals have no clock_root_t identity and no
 * theoretical frequency to compare against; when silicon characterization
 * needs them, measure them with the fsl_freqme + fsl_inputmux drivers using
 * the kINPUTMUX_<SS>_*_ref/_tar connection enums directly. */
static const uint8_t s_cmptRootTar[] = {
    16U, /* cmpt_clk     */ 17U, /* cpu_clk      */ 18U, /* npu_clk      */
    19U, /* systick_clk0 */ 20U, /* systick_clk1 */
};
static const uint8_t s_mainRootTar[] = {
    17U, /* main_clk_divided  */ 21U, /* xspi0_fclk_divided */ 25U, /* xspi1_fclk_divided */
    28U, /* i3c0_fclk         */ 29U, /* lpi2c0_fclk        */ 30U, /* lpi2c1_fclk        */
    31U, /* lpspi0_fclk       */ 32U, /* lpspi1_fclk        */ 33U, /* lpspi2_fclk        */
    34U, /* lpspi3_fclk       */ 35U, /* lpspi4_fclk        */ 36U, /* lpuart0_fclk       */
    37U, /* lpuart1_fclk      */ 38U, /* lpuart2_fclk       */ 39U, /* lpuart3_fclk       */
    40U, /* lpuart4_fclk      */ 41U, /* lpuart5_fclk       */ 42U, /* flexcan0_fclk      */
    43U, /* flexcan1_fclk     */ 44U, /* flexcan2_fclk      */ 45U, /* flexcan_gfclk      */
    46U, /* qtpm0_fclk        */ 47U, /* lpit0_fclk         */ 48U, /* lpit1_fclk         */
    49U, /* adc0_fclk         */ 50U, /* adc1_fclk          */ 51U, /* sinc0_fclk         */
    52U, /* sinc1_fclk        */ 53U, /* flexio0_fclk       */ 54U, /* flexio1_fclk       */
    55U, /* flexio2_fclk      */ 56U, /* tpiu_clk           */ 57U, /* cssi_refclk        */
    58U, /* otp_clk           */ 59U, /* clkout             */ 60U, /* main_fro192m       */
    61U, /* main_ulp32k       */
};
static const uint8_t s_wakeRootTar[] = {
    16U, /* wake_clk     */ 17U, /* wake_sxosc  */ 18U, /* wake_lp1m   */ 19U, /* wake_lp12m  */
    20U, /* wake_ulp32k  */ 21U, /* wake_lpclk  */ 22U, /* i3c0_fclk   */ 23U, /* lpi2c0_fclk */
    24U, /* lpi2c1_fclk  */ 25U, /* lpspi0_fclk */ 26U, /* lpuart0_fclk*/ 27U, /* lpuart1_fclk*/
    28U, /* dmic1_appclk */ 29U, /* qtpm0_fclk  */ 30U, /* lptmr0_fclk */ 31U, /* lptmr1_fclk */
    32U, /* swt0_fclk    */ 33U, /* swt1_fclk   */ 34U, /* ewm_fclk    */ 35U, /* acmp0_fclk  */
    36U, /* acmp1_fclk   */ 37U, /* acmp2_fclk  */ 38U, /* acmp3_fclk  */ 39U, /* acmp0_rrclk */
    40U, /* acmp1_rrclk  */ 41U, /* acmp2_rrclk */ 42U, /* acmp3_rrclk */
};
static const uint8_t s_commRootTar[] = {
    16U,                   /* comm_clk      */
    17U,                   /* comm_ulp32k   */
    18U,                   /* usdhc0_fclk   */
    19U,                   /* usdhc1_fclk   */
    20U,                   /* xspir_rootclk */
    21U,                   /* usb0_phyclk   */
    22U,                   /* usb0_fro48m   */
    23U,                   /* usb1_fclk     */
    24U,                   /* usb0_wakeclk  */
    25U,                   /* eth0_trxclk   */
    26U,                   /* eth0_timerclk */
    27U,                   /* eth1_trxclk   */
    31U,                   /* eth1_timerclk */
    32U,                   /* eth_refclk (eth_tarclk_tar) */
    33U,                   /* xeno0_liwclk  */
    34U,                   /* xeno1_liwclk  */
    35U,                   /* dll_refclk (dll_tarclk_tar) */
};
static const uint8_t s_audioRootTar[] = {
    16U, /* audio_clk  */ 17U, /* dmic0_appclk */ 18U, /* sai0_mclk0   */ 19U, /* sai0_mclk1 */
    20U, /* sai1_mclk0 */ 21U, /* sai1_mclk1   */ 22U, /* sai2_mclk0   */ 23U, /* sai2_mclk1 */
    24U, /* spdif_txclk*/ 25U, /* spdif_cdrclk */ 26U, /* asrc_clk     */
};
static const uint8_t s_mediaRootTar[] = {
    16U, /* media_clk      */ 17U, /* mediapll_clk (mediapll_rootclk_tar)   */
    18U, /* mipicsi_escclk */ 19U, /* mipicsi_clk                           */
    21U, /* mipidsi_escclk_divided                                          */
    24U, /* mipidsi_refclk (mipidsi_tarclk_tar)                             */
    25U, /* mipidsi_clk    */ 26U, /* reformat_fclk (tarormat_fclk_tar)     */
    27U, /* dcpixel_fclk   */ 28U, /* csi_mclkout                           */
};

