zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.c
/*
 * Resolve a root to (measuring domain, FREQMEAS TAR mux value). Returns false
 * for out-of-range roots and roots without a target tap.
 */
static bool CLOCK_LocateFreqmeTar(clock_root_t root, uint32_t *domainIdx, uint8_t *tarMux)
{
    /* Unsigned compare so a stray negative enum cast falls through to the
     * final return false instead of matching the CGU range. */
    if ((uint32_t)root <= (uint32_t)kCLOCK_Root_CGU_END)
    {
        /* CGU roots are tapped by the SYSCON FREQMEAS TAR mux with a formulaic
         * layout (fsl_inputmux_connections.h): roots 0..29 sit at 16..45;
         * root 30 (MAIN_ROOTCLK) is tapped post div+sndDiv at 47
         * (cpu_rootclk_divided -- matching what CLOCK_GetRootClockFreq
         * reports; the post-div-only CPU tap at 46 backs kCLOCK_SRC_CPU);
         * roots 31..48 sit at 50..67. */
        *domainIdx = kCLOCK_FreqmeDomainSyscon;
        if (root <= kCLOCK_Root_CGU_VIDEOPLL_ROOTCLK)
        {
            *tarMux = (uint8_t)((uint32_t)root + 16U);
        }
        else if (root == kCLOCK_Root_CGU_MAIN_ROOTCLK)
        {
            *tarMux = 47U;
        }
        else
        {
            *tarMux = (uint8_t)((uint32_t)root + 19U);
        }
        return true;
    }
    else if ((root >= kCLOCK_Root_CMPT_START) && (root <= kCLOCK_Root_CMPT_END))
    {
        *domainIdx = kCLOCK_FreqmeDomainCmpt;
        *tarMux    = s_cmptRootTar[root - kCLOCK_Root_CMPT_START];
    }
    else if ((root >= kCLOCK_Root_MAIN_START) && (root <= kCLOCK_Root_MAIN_END))
    {
        *domainIdx = kCLOCK_FreqmeDomainMain;
        *tarMux    = s_mainRootTar[root - kCLOCK_Root_MAIN_START];
    }
    else if ((root >= kCLOCK_Root_WAKE_START) && (root <= kCLOCK_Root_WAKE_END))
    {
        *domainIdx = kCLOCK_FreqmeDomainWake;
        *tarMux    = s_wakeRootTar[root - kCLOCK_Root_WAKE_START];
    }
    else if ((root >= kCLOCK_Root_COMM_START) && (root <= kCLOCK_Root_COMM_END))
    {
        *domainIdx = kCLOCK_FreqmeDomainComm;
        *tarMux    = s_commRootTar[root - kCLOCK_Root_COMM_START];
    }
    else if ((root >= kCLOCK_Root_AUDIO_START) && (root <= kCLOCK_Root_AUDIO_END))
    {
        *domainIdx = kCLOCK_FreqmeDomainAudio;
        *tarMux    = s_audioRootTar[root - kCLOCK_Root_AUDIO_START];
    }
    else if ((root >= kCLOCK_Root_MEDIA_START) && (root <= kCLOCK_Root_MEDIA_END))
    {
        *domainIdx = kCLOCK_FreqmeDomainMedia;
        *tarMux    = s_mediaRootTar[root - kCLOCK_Root_MEDIA_START];
    }
    else
    {
        return false;
    }
    return *tarMux != CLOCK_FREQME_TAR_NONE;
}

/*
 * Run one polled FREQME measurement cycle on a domain and convert the result.
 * The domain's FREQME/INPUTMUX access clock is enabled around the cycle and
 * its LPCG_CFG restored afterwards; the measured clock itself is never
 * touched (caller's responsibility -- a gated target shows up as LT_MIN).
 * Returns the frequency in Hz, or 0 with *stat holding the raw CTRLSTAT
 * flags so the caller can tell a too-slow target (LT_MIN) from other errors.
 */
static uint32_t CLOCK_FreqmeMeasureOnce(const clock_freqme_domain_t *dom, uint8_t tarMux,
                                        uint32_t refFreq, uint32_t refScale, uint32_t *stat)
{
    CCM_Type *gateCCM;
    uint32_t  gateIdx;
    uint32_t  savedLpcg;
    uint32_t  timeout;
    uint32_t  result;
    uint32_t  freq = 0U;

    *stat = 0U;

    /* The measurement window is 2^refScale reference cycles; widen the
     * polling bound for scales above 16 (the sizing baseline of
     * FSL_CLOCK_FREQME_TIMEOUT_LOOPS) so long windows (up to ~0.7 s at
     * scale 24 / 24 MHz) are not misreported as timeouts. Saturate rather
     * than wrap if a large user override leaves no headroom for the
     * shift (max shift is 8, scale cap 24). */
    timeout = FSL_CLOCK_FREQME_TIMEOUT_LOOPS;
    if (refScale > 16U)
    {
        if (timeout > (UINT32_MAX >> (refScale - 16U)))
        {
            timeout = UINT32_MAX;
        }
        else
        {
            timeout <<= (refScale - 16U);
        }
    }

    gateCCM   = locateClkGate(dom->gate, &gateIdx);
    if (NULL == gateCCM) { return 0U; }
    savedLpcg = gateCCM->CGC_ROOT[gateIdx].SLICE_CONTROL & CCM_SLICE_CONTROL_LPCG_CFG_MASK;
    CLOCK_EnableClock(dom->gate);

    dom->inputmux->FREQME_REF = INPUTMUX_FREQME_REF_INP(dom->refMux);
    dom->inputmux->FREQME_TAR = INPUTMUX_FREQME_TAR_INP(tarMux);

    /* MIN flags a dead or too-slow target; MAX encodes the 2 GHz device
     * ceiling as a count: (2 GHz / 24 MHz rounded up) << scale. */
    dom->freqme->MIN = CLOCK_FREQME_MIN_EXPECTED;
    dom->freqme->MAX = CLOCK_FREQME_MAX_RATIO << refScale;

    /* Clear stale W1C status flags (CTRLSTAT mirrors the control fields, so
     * plain |= only sets the write-1-to-clear bits). */
    dom->freqme->CTRLSTAT = dom->freqme->CTRLSTAT | FREQME_CTRLSTAT_LT_MIN_STAT_MASK |
                            FREQME_CTRLSTAT_GT_MAX_STAT_MASK | FREQME_CTRLSTAT_RESULT_READY_STAT_MASK;

    /* Configure and start in a single write. CTRL_W is write-only (reading
     * offset 0 returns CTRL_R) -- never read-modify-write it. Frequency
     * measurement mode: PULSE_MODE = 0, continuous mode and interrupts off. */
    dom->freqme->CTRL_W = FREQME_CTRL_W_REF_SCALE(refScale) | FREQME_CTRL_W_MEASURE_IN_PROGRESS_MASK;

    while (((dom->freqme->CTRL_R & FREQME_CTRL_R_MEASURE_IN_PROGRESS_MASK) != 0U) && (timeout > 0U))
    {
        timeout--;
    }

    if ((dom->freqme->CTRL_R & FREQME_CTRL_R_MEASURE_IN_PROGRESS_MASK) != 0U)
    {
        /* Timed out -- reference clock dead; terminate the cycle. */
        dom->freqme->CTRL_W = 0U;
    }
    else
    {
        *stat = dom->freqme->CTRLSTAT;
        if (((*stat & FREQME_CTRLSTAT_RESULT_READY_STAT_MASK) != 0U) &&
            ((*stat & (FREQME_CTRLSTAT_LT_MIN_STAT_MASK | FREQME_CTRLSTAT_GT_MAX_STAT_MASK)) == 0U))
        {
            result = dom->freqme->CTRL_R & FREQME_CTRL_R_RESULT_MASK;
            /* Ftar = (RESULT + 1) * Fref / 2^REF_SCALE
             * (FSL_FEATURE_FREQME_RESULT_CALCULATION_MODE == 1 on RT2660). */
            freq = (uint32_t)((((uint64_t)result + 1ULL) * (uint64_t)refFreq) >> refScale);
        }
    }

    gateCCM->CGC_ROOT[gateIdx].SLICE_CONTROL =
        (gateCCM->CGC_ROOT[gateIdx].SLICE_CONTROL & ~CCM_SLICE_CONTROL_LPCG_CFG_MASK) | savedLpcg;

    return freq;
}

