zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.c
/*
 * Measure one target of a domain: resolve the domain reference frequency
 * (crystal-known, or pre-measured against SXOSC via the SYSCON FREQME), then
 * measure the target, escalating the reference scale on underflow so slow
 * targets against fast references still resolve.
 */
static uint32_t CLOCK_FreqmeMeasure(uint32_t domainIdx, uint8_t tarMux)
{
    static const clock_freqme_domain_t s_freqmeDomains[] = {
        [kCLOCK_FreqmeDomainSyscon] = {SYSCON__FREQME, SYSCON__INPUTMUX, kCLOCK_SYSCON_freqme,
                                       16U /* sxosc_rootclk_ref */, CLOCK_FREQME_REF_IS_SXOSC,
                                       kCLOCK_Root_CGU_SXOSC_ROOTCLK},
        [kCLOCK_FreqmeDomainCmpt]   = {CMPT__FREQME, CMPT__INPUTMUX, kCLOCK_CMPT_freqme,
                                       17U /* cpu_clk_ref */, 46U /* cpu_rootclk_tar */,
                                       kCLOCK_Root_Invalid},
        [kCLOCK_FreqmeDomainMain]   = {MAIN__FREQME, MAIN__INPUTMUX, kCLOCK_MAIN_freqme,
                                       60U /* main_fro192m_ref */,
                                       33U /* fro192m_rootclk_tar */, kCLOCK_Root_Invalid},
        [kCLOCK_FreqmeDomainWake]   = {WAKE__FREQME, WAKE__INPUTMUX, kCLOCK_WAKE_freqme,
                                       17U /* wake_sxosc_ref */, CLOCK_FREQME_REF_IS_SXOSC,
                                       kCLOCK_Root_WAKE_wake_sxosc},
        [kCLOCK_FreqmeDomainComm]   = {COMM__FREQME, COMM__INPUTMUX, kCLOCK_COMM_freqme,
                                       16U /* comm_clk_ref */, 53U /* commbus_rootclk_tar */,
                                       kCLOCK_Root_Invalid},
        [kCLOCK_FreqmeDomainAudio]  = {AUDIO__FREQME, AUDIO__INPUTMUX, kCLOCK_AUDIO_freqme,
                                       16U /* audio_clk_ref */, 52U /* audiobus_rootclk_tar */,
                                       kCLOCK_Root_Invalid},
        [kCLOCK_FreqmeDomainMedia]  = {MEDIA__FREQME, MEDIA__INPUTMUX, kCLOCK_MEDIA_freqme,
                                       16U /* media_clk_ref */, 51U /* mediabus_rootclk_tar */,
                                       kCLOCK_Root_Invalid},
    };
    const clock_freqme_domain_t *dom = &s_freqmeDomains[domainIdx];
    uint32_t refFreq;
    uint32_t scale = FSL_CLOCK_FREQME_REF_SCALE;
    uint32_t stat;
    uint32_t freq;

    if (scale > CLOCK_FREQME_SCALE_MAX)
    {
        scale = CLOCK_FREQME_SCALE_MAX;
    }

    if (dom->sysconTarRef == CLOCK_FREQME_REF_IS_SXOSC)
    {
        /* Crystal-derived reference: the theoretical value is the actual one. */
        refFreq = CLOCK_GetRootClockFreq(dom->refRoot);
    }
    else
    {
        /* Two-level chain: measure this domain's reference against SXOSC
         * first (single-level recursion -- SYSCON is crystal-referenced). */
        refFreq = CLOCK_FreqmeMeasure(kCLOCK_FreqmeDomainSyscon, dom->sysconTarRef);
    }
    if (refFreq == 0U)
    {
        return 0U;
    }

    for (;;)
    {
        freq = CLOCK_FreqmeMeasureOnce(dom, tarMux, refFreq, scale, &stat);
        if ((freq != 0U) || ((stat & FREQME_CTRLSTAT_LT_MIN_STAT_MASK) == 0U) ||
            (scale >= CLOCK_FREQME_SCALE_MAX))
        {
            break;
        }
        /* Underflow: target too slow for this scale -- lengthen the window. */
        scale += 4U;
        if (scale > CLOCK_FREQME_SCALE_MAX)
        {
            scale = CLOCK_FREQME_SCALE_MAX;
        }
    }
    return freq;
}

uint32_t CLOCK_MeasureRootClockFreq(clock_root_t root)
{
    uint32_t domainIdx;
    uint8_t  tarMux;

    if (!CLOCK_LocateFreqmeTar(root, &domainIdx, &tarMux))
    {
        return 0U;
    }
    return CLOCK_FreqmeMeasure(domainIdx, tarMux);
}

uint32_t CLOCK_MeasureClockSrcFreq(clock_name_t name)
{
    uint32_t freq;

    /* kCLOCK_SRC_CPU taps CGU ROOT 30 after the first divider only; SYSCON
     * TAR 46 (cpu_rootclk) taps that same hardware point directly, so no
     * sndDiv backout is needed (contrast CLOCK_GetClockSrcFreq). */
    if (name == kCLOCK_SRC_CPU)
    {
        return CLOCK_FreqmeMeasure(kCLOCK_FreqmeDomainSyscon, 46U);
    }

    if ((uint32_t)name < (uint32_t)kCLOCK_SRC_BOUNDARY)
    {
        clock_root_t root = s_clockSrcRootMap[name];
        if (root == kCLOCK_Root_Invalid)
        {
            return 0U;
        }
        freq = CLOCK_MeasureRootClockFreq(root);

        /* The six Mx sources add a MODCON-controlled /2 after the parent
         * root; the divider is deterministic, so halving the measured parent
         * is exact (same range check as CLOCK_GetClockSrcFreq). */
        if (((uint32_t)name >= (uint32_t)kCLOCK_SRC_MAIN_PERI0_DIV2) &&
            ((uint32_t)name <= (uint32_t)kCLOCK_SRC_COMMPFDX_DIV2) &&
            CLOCK_GetClockSrcDiv2(name))
        {
            freq /= 2U;
        }
        return freq;
    }

    /* Terminal analog/external sources have no FREQMEAS tap; measure the
     * corresponding root alias instead (e.g. kCLOCK_SRC_FRO192M). */
    return 0U;
}

/*******************************************************************************
 * Main/System PLL output enable APIs
 *
 * MainPLL and SysPLL share an identical register layout in PERI_CGUANA.h:
 * PLL1_REG holds Div5/8/10/20 EN at bits 3/5/7/9, PLL2_REG holds
 * Divfrac0/1/2 EN at bits 0/8/16. The mapping table below uses the
 * MAINPLL_* mask constants; SYSPLL_* masks resolve to identical values.
 * The target PLL is selected by a small (pll -> {PLL1_REG offset,
 * PLL2_REG offset}) lookup at runtime.
 *
 * The kCLOCK_MainSysPllOutput_All value toggles all 7 EN bits in one call.
 *
 * Each per-output call does one 32-bit read-modify-write; the _All call
 * does one RMW per involved register (PLL1_REG and PLL2_REG). No PLL
 * bring-up sequencing; no _STS / _LOCK / _READY bit is polled.
 ******************************************************************************/

/* Aggregate masks for the _All variant. MAINPLL_* used; SYSPLL_* are bit-identical. */
#define CLOCK_MAIN_SYS_PLL_PLL1_ALL_MASK                                    \
    (CGUANA_CGUA_MAINPLL_PLL1_REG_MAINPLL_DIV5_EN_MASK  |                   \
     CGUANA_CGUA_MAINPLL_PLL1_REG_MAINPLL_DIV8_EN_MASK  |                   \
     CGUANA_CGUA_MAINPLL_PLL1_REG_MAINPLL_DIV10_EN_MASK |                   \
     CGUANA_CGUA_MAINPLL_PLL1_REG_MAINPLL_DIV20_EN_MASK)

#define CLOCK_MAIN_SYS_PLL_PLL2_ALL_MASK                                    \
    (CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC0_EN_MASK |                \
     CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC1_EN_MASK |                \
     CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC2_EN_MASK)

typedef struct _clock_main_sys_pll_regs
{
    uint16_t pll1_offset; /* offsetof(CGUANA_Type, CGUA_<PLL>_PLL1_REG) */
    uint16_t pll2_offset; /* offsetof(CGUANA_Type, CGUA_<PLL>_PLL2_REG) */
} clock_main_sys_pll_regs_t;

