zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.c
static const clock_main_sys_pll_regs_t s_mainSysPllRegs[kCLOCK_MainSysPll_Count] = {
    [kCLOCK_MainSysPll_Main] = { (uint16_t)offsetof(CGUANA_Type, CGUA_MAINPLL_PLL1_REG),
                                 (uint16_t)offsetof(CGUANA_Type, CGUA_MAINPLL_PLL2_REG) },
    [kCLOCK_MainSysPll_Sys]  = { (uint16_t)offsetof(CGUANA_Type, CGUA_SYSPLL_PLL1_REG),
                                 (uint16_t)offsetof(CGUANA_Type, CGUA_SYSPLL_PLL2_REG) },
};

typedef struct _clock_main_sys_pll_output_map
{
    uint8_t  regIndex; /* 0 = PLL1_REG (Div5/8/10/20), 1 = PLL2_REG (Divfrac0/1/2) */
    uint32_t mask;
} clock_main_sys_pll_output_map_t;

/* Indexed by kCLOCK_MainSysPllOutput_Div5..Divfrac2 (0..6). _All is handled inline. */
static const clock_main_sys_pll_output_map_t s_mainSysPllOutputMap[kCLOCK_MainSysPllOutput_All] = {
    [kCLOCK_MainSysPllOutput_Div5]     = { 0U, CGUANA_CGUA_MAINPLL_PLL1_REG_MAINPLL_DIV5_EN_MASK },
    [kCLOCK_MainSysPllOutput_Div8]     = { 0U, CGUANA_CGUA_MAINPLL_PLL1_REG_MAINPLL_DIV8_EN_MASK },
    [kCLOCK_MainSysPllOutput_Div10]    = { 0U, CGUANA_CGUA_MAINPLL_PLL1_REG_MAINPLL_DIV10_EN_MASK },
    [kCLOCK_MainSysPllOutput_Div20]    = { 0U, CGUANA_CGUA_MAINPLL_PLL1_REG_MAINPLL_DIV20_EN_MASK },
    [kCLOCK_MainSysPllOutput_Divfrac0] = { 1U, CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC0_EN_MASK },
    [kCLOCK_MainSysPllOutput_Divfrac1] = { 1U, CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC1_EN_MASK },
    [kCLOCK_MainSysPllOutput_Divfrac2] = { 1U, CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC2_EN_MASK },
};

static volatile uint32_t *main_sys_pll_pll1_reg(clock_main_sys_pll_t pll)
{
    return (volatile uint32_t *)((uintptr_t)SYSCON__CGUANA + s_mainSysPllRegs[pll].pll1_offset);
}

static volatile uint32_t *main_sys_pll_pll2_reg(clock_main_sys_pll_t pll)
{
    return (volatile uint32_t *)((uintptr_t)SYSCON__CGUANA + s_mainSysPllRegs[pll].pll2_offset);
}

static volatile uint32_t *main_sys_pll_output_reg(clock_main_sys_pll_t pll, clock_main_sys_pll_output_t out)
{
    return (s_mainSysPllOutputMap[out].regIndex == 0U) ? main_sys_pll_pll1_reg(pll)
                                                       : main_sys_pll_pll2_reg(pll);
}

void CLOCK_EnableMainSysPllOutput(clock_main_sys_pll_t pll, clock_main_sys_pll_output_t out)
{
    if (((uint32_t)pll >= (uint32_t)kCLOCK_MainSysPll_Count) ||
        ((uint32_t)out >= (uint32_t)kCLOCK_MainSysPllOutput_Count))
    {
        return;
    }
    if (out == kCLOCK_MainSysPllOutput_All)
    {
        *main_sys_pll_pll1_reg(pll) |= CLOCK_MAIN_SYS_PLL_PLL1_ALL_MASK;
        *main_sys_pll_pll2_reg(pll) |= CLOCK_MAIN_SYS_PLL_PLL2_ALL_MASK;
    }
    else
    {
        *main_sys_pll_output_reg(pll, out) |= s_mainSysPllOutputMap[out].mask;
    }
}

void CLOCK_DisableMainSysPllOutput(clock_main_sys_pll_t pll, clock_main_sys_pll_output_t out)
{
    if (((uint32_t)pll >= (uint32_t)kCLOCK_MainSysPll_Count) ||
        ((uint32_t)out >= (uint32_t)kCLOCK_MainSysPllOutput_Count))
    {
        return;
    }
    if (out == kCLOCK_MainSysPllOutput_All)
    {
        *main_sys_pll_pll1_reg(pll) &= ~CLOCK_MAIN_SYS_PLL_PLL1_ALL_MASK;
        *main_sys_pll_pll2_reg(pll) &= ~CLOCK_MAIN_SYS_PLL_PLL2_ALL_MASK;
    }
    else
    {
        *main_sys_pll_output_reg(pll, out) &= ~s_mainSysPllOutputMap[out].mask;
    }
}

bool CLOCK_IsMainSysPllOutputEnabled(clock_main_sys_pll_t pll, clock_main_sys_pll_output_t out)
{
    if (((uint32_t)pll >= (uint32_t)kCLOCK_MainSysPll_Count) ||
        ((uint32_t)out >= (uint32_t)kCLOCK_MainSysPllOutput_Count))
    {
        return false;
    }
    if (out == kCLOCK_MainSysPllOutput_All)
    {
        return ((*main_sys_pll_pll1_reg(pll) & CLOCK_MAIN_SYS_PLL_PLL1_ALL_MASK) == CLOCK_MAIN_SYS_PLL_PLL1_ALL_MASK) &&
               ((*main_sys_pll_pll2_reg(pll) & CLOCK_MAIN_SYS_PLL_PLL2_ALL_MASK) == CLOCK_MAIN_SYS_PLL_PLL2_ALL_MASK);
    }
    return (*main_sys_pll_output_reg(pll, out) & s_mainSysPllOutputMap[out].mask) != 0U;
}

/*******************************************************************************
 * Audio/Video PLL CLKOUT enable APIs
 *
 * AUDIOPLL_CLKOUT_EN and VIDEOPLL_CLKOUT_EN share the same bit (bit 3 of the
 * respective PLL1_REG); the CLOCK_AV_PLL_CLKOUT_EN_MASK below aliases the
 * AUDIOPLL_* mask constant.
 ******************************************************************************/

static const uint16_t s_avPllPll1RegOffset[kCLOCK_AvPll_Count] = {
    [kCLOCK_AvPll_Audio] = (uint16_t)offsetof(CGUANA_Type, CGUA_AUDIOPLL_PLL1_REG),
    [kCLOCK_AvPll_Video] = (uint16_t)offsetof(CGUANA_Type, CGUA_VIDEOPLL_PLL1_REG),
};

#define CLOCK_AV_PLL_CLKOUT_EN_MASK CGUANA_CGUA_AUDIOPLL_PLL1_REG_AUDIOPLL_CLKOUT_EN_MASK

static volatile uint32_t *av_pll_pll1_reg(clock_av_pll_t pll)
{
    return (volatile uint32_t *)((uintptr_t)SYSCON__CGUANA + s_avPllPll1RegOffset[pll]);
}

void CLOCK_EnableAvPllClkout(clock_av_pll_t pll)
{
    if ((uint32_t)pll >= (uint32_t)kCLOCK_AvPll_Count)
    {
        return;
    }
    *av_pll_pll1_reg(pll) |= CLOCK_AV_PLL_CLKOUT_EN_MASK;
}

void CLOCK_DisableAvPllClkout(clock_av_pll_t pll)
{
    if ((uint32_t)pll >= (uint32_t)kCLOCK_AvPll_Count)
    {
        return;
    }
    *av_pll_pll1_reg(pll) &= ~CLOCK_AV_PLL_CLKOUT_EN_MASK;
}

bool CLOCK_IsAvPllClkoutEnabled(clock_av_pll_t pll)
{
    if ((uint32_t)pll >= (uint32_t)kCLOCK_AvPll_Count)
    {
        return false;
    }
    return (*av_pll_pll1_reg(pll) & CLOCK_AV_PLL_CLKOUT_EN_MASK) != 0U;
}

#if defined(CLOCK_ENABLE_INFO_DUMP) && CLOCK_ENABLE_INFO_DUMP
/*!
 * @brief Dump a clock-root capability table to the debug console.
 *
 * See fsl_clock.h for the full API contract.
 */
void CLOCK_InfoDump(void)
{
    /* Flat lookup table: index == clock_root_t enum value, NULL for gaps.
     * Max enum value is kCLOCK_Root_MEDIA_csi_mclkout = 217. */
    static const char * const s_rootNames[218] = {
        /* CGU  0-52 */
        [0]   = "CGU_SXOSC_ROOTCLK",
        [1]   = "CGU_BASE_CLK",
        [2]   = "CGU_LOW_CLK",
        [3]   = "CGU_MAINPLL_DIVX",
        [4]   = "CGU_SYSPLL_DIVX",
        [5]   = "CGU_PLL_PFDX",
        [6]   = "CGU_MEDIA_PFDX",
        [7]   = "CGU_MAINPFDX_ROOTCLK",
        [8]   = "CGU_COMMPFDX_ROOTCLK",
        [9]   = "CGU_MAINDIVX_ROOTCLK",
        [10]  = "CGU_SAIMCLK_ROOTCLK",
        [11]  = "CGU_SAIMCLK0_ROOTCLK",
        [12]  = "CGU_SAIMCLK1_ROOTCLK",
        [13]  = "CGU_SAIMCLK2_ROOTCLK",
        [14]  = "CGU_LP12M_CORE_ROOTCLK",
        [15]  = "CGU_LP1M_CORE_ROOTCLK",
        [16]  = "CGU_ULP32K_ROOTCLK",
        [17]  = "CGU_FRO192M_ROOTCLK",
        [18]  = "CGU_FRO96M_ROOTCLK",
        [19]  = "CGU_FRO48M_ROOTCLK",
        [20]  = "CGU_FRO24M_ROOTCLK",
        [21]  = "CGU_SYSPLLDIV4_ROOTCLK",
        [22]  = "CGU_SYSPLLDIV5_ROOTCLK",
        [23]  = "CGU_SYSPLLDIVX_ROOTCLK",
        [24]  = "CGU_MAINPLLDIVX_ROOTCLK",
        [25]  = "CGU_MAINPLLDIV8_ROOTCLK",
        [26]  = "CGU_MAINPLLDIV10_ROOTCLK",
        [27]  = "CGU_MAINPLLDIV20_ROOTCLK",
        [28]  = "CGU_AUDIOPLL_ROOTCLK",
        [29]  = "CGU_VIDEOPLL_ROOTCLK",
        [30]  = "CGU_MAIN_ROOTCLK",
        [31]  = "CGU_NPU_ROOTCLK",
        [32]  = "CGU_MEDIABUS_ROOTCLK",
        [33]  = "CGU_AUDIOBUS_ROOTCLK",
        [34]  = "CGU_COMMBUS_ROOTCLK",
        [35]  = "CGU_WAKEBUS_ROOTCLK",
        [36]  = "CGU_SYSCON_PDMAIN_CLK",
        [37]  = "CGU_PERI_ROOTCLK0",
        [38]  = "CGU_PERI_ROOTCLK1",
        [39]  = "CGU_PERI_ROOTCLK2",
        [40]  = "CGU_PERI_ROOTCLK3",
        [41]  = "CGU_PERI_ROOTCLK4",
        [42]  = "CGU_PERI_ROOTCLK5",
        [43]  = "CGU_PERI_ROOTCLK6",
        [44]  = "CGU_PERI_ROOTCLK7",
        [45]  = "CGU_AUDIO_ROOTCLK",
        [46]  = "CGU_VIDEO_ROOTCLK",
        [47]  = "CGU_USB1_ROOTCLK",
        [48]  = "CGU_ETH_ROOTCLK",
        [49]  = "CGU_TEST_ROOTCLK",
        [50]  = "CGU_CLKOUT",
        [51]  = "CGU_MAIN_FRO192M",
        [52]  = "CGU_MAIN_ULP32K",
        /* 53-63 gap */
        /* CMPT 64-68 */
        [64]  = "CMPT_cmpt_clk",
        [65]  = "CMPT_cpu_clk",
        [66]  = "CMPT_npu_clk",
        [67]  = "CMPT_systick_clk0",
        [68]  = "CMPT_systick_clk1",
        /* 69-79 gap */
        /* MAIN 80-116 */
        [80]  = "MAIN_main_clk_divided",
        [81]  = "MAIN_xspi0_fclk_divided",
        [82]  = "MAIN_xspi1_fclk_divided",
        [83]  = "MAIN_i3c0_fclk",
        [84]  = "MAIN_lpi2c0_fclk",
        [85]  = "MAIN_lpi2c1_fclk",
        [86]  = "MAIN_lpspi0_fclk",
        [87]  = "MAIN_lpspi1_fclk",
        [88]  = "MAIN_lpspi2_fclk",
        [89]  = "MAIN_lpspi3_fclk",
        [90]  = "MAIN_lpspi4_fclk",
        [91]  = "MAIN_lpuart0_fclk",
        [92]  = "MAIN_lpuart1_fclk",
        [93]  = "MAIN_lpuart2_fclk",
        [94]  = "MAIN_lpuart3_fclk",
        [95]  = "MAIN_lpuart4_fclk",
        [96]  = "MAIN_lpuart5_fclk",
        [97]  = "MAIN_flexcan0_fclk",
        [98]  = "MAIN_flexcan1_fclk",
        [99]  = "MAIN_flexcan2_fclk",
        [100] = "MAIN_flexcan_gfclk",
        [101] = "MAIN_qtpm0_fclk",
        [102] = "MAIN_lpit0_fclk",
        [103] = "MAIN_lpit1_fclk",
        [104] = "MAIN_adc0_fclk",
        [105] = "MAIN_adc1_fclk",
        [106] = "MAIN_sinc0_fclk",
        [107] = "MAIN_sinc1_fclk",
        [108] = "MAIN_flexio0_fclk",
        [109] = "MAIN_flexio1_fclk",
        [110] = "MAIN_flexio2_fclk",
        [111] = "MAIN_tpiu_clk",
        [112] = "MAIN_cssi_refclk",
        [113] = "MAIN_otp_clk",
        [114] = "MAIN_clkout",
        [115] = "MAIN_fro192m",
        [116] = "MAIN_ulp32k",
        /* 117-127 gap */
        /* WAKE 128-154 */
        [128] = "WAKE_wake_clk",
        [129] = "WAKE_wake_sxosc",
        [130] = "WAKE_wake_lp1m",
        [131] = "WAKE_wake_lp12m",
        [132] = "WAKE_wake_ulp32k",
        [133] = "WAKE_wake_lpclk",
        [134] = "WAKE_i3c0_fclk",
        [135] = "WAKE_lpi2c0_fclk",
        [136] = "WAKE_lpi2c1_fclk",
        [137] = "WAKE_lpspi0_fclk",
        [138] = "WAKE_lpuart0_fclk",
        [139] = "WAKE_lpuart1_fclk",
        [140] = "WAKE_dmic1_appclk",
        [141] = "WAKE_qtpm0_fclk",
        [142] = "WAKE_lptmr0_fclk",
        [143] = "WAKE_lptmr1_fclk",
        [144] = "WAKE_swt0_fclk",
        [145] = "WAKE_swt1_fclk",
        [146] = "WAKE_ewm_fclk",
        [147] = "WAKE_acmp0_fclk",
        [148] = "WAKE_acmp1_fclk",
        [149] = "WAKE_acmp2_fclk",
        [150] = "WAKE_acmp3_fclk",
        [151] = "WAKE_acmp0_rrclk",
        [152] = "WAKE_acmp1_rrclk",
        [153] = "WAKE_acmp2_rrclk",
        [154] = "WAKE_acmp3_rrclk",
        /* 155-159 gap */
        /* COMM 160-176 */
        [160] = "COMM_comm_clk",
        [161] = "COMM_comm_ulp32k",
        [162] = "COMM_usdhc0_fclk",
        [163] = "COMM_usdhc1_fclk",
        [164] = "COMM_xspir_rootclk",
        [165] = "COMM_usb0_phyclk",
        [166] = "COMM_usb0_fro48m",
        [167] = "COMM_usb1_fclk",
        [168] = "COMM_usb0_wakeclk",
        [169] = "COMM_eth0_trxclk",
        [170] = "COMM_eth0_timerclk",
        [171] = "COMM_eth1_trxclk",
        [172] = "COMM_eth1_timerclk",
        [173] = "COMM_eth_refclk",
        [174] = "COMM_xeno0_liwclk",
        [175] = "COMM_xeno1_liwclk",
        [176] = "COMM_dll_refclk",
        /* 177-191 gap */
        /* AUDIO 192-202 */
        [192] = "AUDIO_audio_clk",
        [193] = "AUDIO_dmic0_appclk",
        [194] = "AUDIO_sai0_mclk0",
        [195] = "AUDIO_sai0_mclk1",
        [196] = "AUDIO_sai1_mclk0",
        [197] = "AUDIO_sai1_mclk1",
        [198] = "AUDIO_sai2_mclk0",
        [199] = "AUDIO_sai2_mclk1",
        [200] = "AUDIO_spdif_txclk",
        [201] = "AUDIO_spdif_cdrclk",
        [202] = "AUDIO_asrc_clk",
        /* 203-207 gap */
        /* MEDIA 208-217 */
        [208] = "MEDIA_media_clk",
        [209] = "MEDIA_mediapll_clk",
        [210] = "MEDIA_mipicsi_escclk",
        [211] = "MEDIA_mipicsi_clk",
        [212] = "MEDIA_mipidsi_escclk_divided",
        [213] = "MEDIA_mipidsi_refclk",
        [214] = "MEDIA_mipidsi_clk",
        [215] = "MEDIA_reformat_fclk",
        [216] = "MEDIA_dcpixel_fclk",
        [217] = "MEDIA_csi_mclkout",
    };

    clock_root_t root;
    uint32_t     index;
    CCM_Type    *targetCCM;
    uint32_t     status1;

    /* Table header */
    PRINTF("%-4s  %-32s  %-11s  %-10s  %-8s  %-13s  %-11s\r\n",
           "id", "name", "glitch_free", "divPresent", "divWidth",
           "sndDivPresent", "sndDivWidth");
    PRINTF("----  --------------------------------  -----------  ----------  --------  -------------  -----------\r\n");

    for (root = kCLOCK_Root_CGU_START; root <= kCLOCK_Root_MEDIA_END; root++)
    {
        targetCCM = locateClkRoot(root, &index);
        if (targetCCM == NULL)
        {
            continue;
        }
        status1 = targetCCM->CLOCK_ROOT[index].STATUS1;

        bool     glitchFree = (status1 & CCM_STATUS1_GLITCH_FREE_MASK)            != 0UL;
        bool     divPresent = (status1 & CCM_STATUS1_DIVIDER_PRESENT_MASK)        != 0UL;
        uint32_t divWidth   = (status1 & CCM_STATUS1_DIV_WIDTH_MASK)
                              >> CCM_STATUS1_DIV_WIDTH_SHIFT;
        bool     sndPresent = (status1 & CCM_STATUS1_SECOND_DIVIDER_PRESENT_MASK) != 0UL;
        uint32_t sndWidth   = (status1 & CCM_STATUS1_SECOND_DIV_WIDTH_MASK)
                              >> CCM_STATUS1_SECOND_DIV_WIDTH_SHIFT;

        const char *name = ((uint32_t)root < 218U && s_rootNames[(uint32_t)root] != NULL)
                           ? s_rootNames[(uint32_t)root] : "?";

        PRINTF("%-4u  %-4u  %-32s  %-11s  %-10s  %-8u  %-13s  %-11u\r\n",
               (unsigned)root, index, name,
               glitchFree ? "yes" : "no",
               divPresent ? "yes" : "no",
               (unsigned)divWidth,
               sndPresent ? "yes" : "no",
               (unsigned)sndWidth);
    }
}
#endif
